{
    "Name": "FAQ",
    "Title": "Preguntas Frecuentes",
    "Sections": [
        {
            "Name": "FAQ",
            "PageGroups": [
                {
                    "Name": "FAQ",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p><b>Q: ¿Qué actividades se supone que debo hacer y cuándo?</b></p><br><p><b>A:</b> Idealmente, completarás dos Microdosis (también conocidas como 'sesiones') en cualquier momento y una Encuesta Nocturna al final del día, para un total de 3 tareas cada día. Además, deberás completar la Encuesta de Seguimiento de tu Progreso cuando esté disponible, una vez cada dos semanas durante ocho semanas.</p><br><p><b>Q: ¿Por qué algunos de los ejercicios son repetitivos?</b></p><br><p><b>A:</b> La aplicación está diseñada para desarrollar el hábito del pensamiento flexible mediante entrenamiento repetido. Creemos que la repetición es necesaria para desarrollar nuevas habilidades de pensamiento. Cambiar nuestros hábitos de pensamiento lleva tiempo, ¡así que tenga paciencia y persevere!</p><br><p><b>Q: ¿Por qué algunos escenarios tienen un final negativo?</b></p><br><p><b>A:</b> El propósito de MindTrails es fomentar la flexibilidad entre pensamientos positivos, negativos y neutrales. A medida que practiques, aprenderás que hay muchas formas diferentes de interpretar una situación y que el peor de los casos es sólo una de ellas.</p><br><p><b>Q: ¿Qué hago si no recibo notificaciones de la aplicación?</b></p><br><p><b>A:</b> ¡Aquí hay algunas sugerencias! Asegúrate de que tus notificaciones estén habilitadas. Para hacer esto, ve a la aplicación de configuración de tu teléfono y haz clic en MindTrails. Luego selecciona permitir notificaciones. También hemos descubierto que las notificaciones son más confiables cuando la aplicación MindTrails se ejecuta en segundo plano en tu teléfono en todo momento. Si tiendes a cerrar tus aplicaciones, te recomendamos evitar hacerlo con MindTrails. Si necesitas comunicarte con nosotros para obtener más ayuda, asegúrate de responder las siguientes preguntas: ¿Qué dispositivo estás usando (por ejemplo, iPhone, Android)? ¿Qué versión del sistema operativo estás utilizando (por ejemplo, iOS 16.3.1)? ¿Qué versión de la aplicación tienes (por ejemplo, 1.5.0)? Si prefieres tener recordatorios por correo electrónico programados para ti, estaremos encantados de poder hacerlo también.</p><br><p><b>Q: ¿Qué es el CBM-I?</b></p><br><p><b>A:</b> CBM-I significa modificación de interpretaciones por sesgo cognitivo. Esta es una estrategia comúnmente utilizada para intentar modificar los sesgos cognitivos que a menudo están presentes en personas que luchan contra la ansiedad. Estos sesgos pueden manifestarse cuando los individuos interpretan automáticamente ciertos estímulos ambiguos de manera negativa. CBM-I proporciona práctica repetida de pensamiento en nuevas formas para intentar alterar los procesos automáticos de pensamiento negativo y promover patrones de pensamiento flexibles.</p><br><p><b>Q: ¿A quién debo comunicarme si tengo dificultades técnicas?</b></p><br><p><b>A:</b> Puedes ponerte en contacto con mindtrailsespanol@gmail.com si tienes algún problema técnico. Para obtener la mejor asistencia, incluye la siguiente información en tu correo electrónico: ¿Qué dispositivo estás utilizando (por ejemplo, iPhone, teléfono Android)? ¿Qué versión del sistema operativo estás utilizando (por ejemplo, iOS 16.3.1)? ¿Qué versión de la aplicación tienes (por ejemplo, 1.5.0)?</p><br><p><b>Q: Al responder preguntas (siguiendo cada una de las historias breves), el programa me sigue diciendo que mi respuesta es incorrecta.</b></p><br><p><b>A:</b> Responde las preguntas basándote en la información que se te proporcionó en las historias. Recuerda que es fundamental que te involucres plenamente como si los hechos descritos realmente te estuvieran sucediendo a ti, por lo que tus respuestas deben reflejar eso.</p><br><p><b>Q: Al intentar completar fragmentos de palabras al final de las historias breves, el programa sigue diciéndome que mi respuesta es incorrecta.</b></p><br><p><b>A:</b> Completa los fragmentos de palabras basándote únicamente en la información que se te proporcionó en las historias breves.</p><br><p><b>Q: Cuando la aplicación está abierta, ¿está agotando la batería de mi teléfono?</b></p><br><p><b>A:</b> La aplicación tiene un impacto mínimo en el uso de la batería porque no recopila datos cuando no se utiliza activamente.</p><br><p><b>Q: ¿Cómo se protegen mis datos?</b></p><br><p><b>A:</b> Tus datos están protegidos de acuerdo con las mejores prácticas y leyes de la industria de la salud. Esto incluye siempre cifrar tus datos, almacenar los datos que te identifican por separado de los que no te identifican, utilizar únicamente servidores seguros en instalaciones protegidas y exigir a todos los investigadores y desarrolladores con acceso a tus datos que pasen rutinariamente una capacitación en seguridad. Todas las prácticas de seguridad son revisadas y auditadas por el Departamento de Seguridad de Tecnologías de la Información de la UVA.</p>"

                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
