{
    "Number": 1,
    "Name": "Session1_long",
    "Title": "Week 1: Part 2",
    "TimeToComplete": "00:10:00",
    "Description": "Please select the domain you'd like to work on today.",
    "ImageHeight": 200,
    "BeforeDomain": [
        {
            "Name": "Welcome Back!",
            "Title": "Welcome Back!",
            "Description": [
                "Welcome back to MindTrails! Let's get started with practicing flexible thinking. \n\nToday, you will: answer a few questions about your anxiety, complete 3 scenarios that challenge you to come up with thoughts, feelings, and behaviors, and wrap-up with a Quick Thinking exercise. \n\nLet's get started!"
            ],
            "Type": "Single",
            "Number": 0
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how anxious have you felt? \n\n0 = Most calm I could imagine being. \n\n10 = Most anxious, panicked, or scared I could imagine being."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": 0,
                    "Maximum": 10,
                    "OtherChoices": [
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -1
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much were you able to change the way you thought about things when you wanted to feel better. \n\nAn example might be: If you were feeling worried about an upcoming test, were you able to remind yourself that you studied a lot and were prepared? \n\n0 = Not at all - I wasn't able to think in different ways to feel better. \n\n10 = Completely - I was totally able to think in different ways to feel better. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": 0,
                    "Maximum": 10,
                    "OtherChoices": [
                        "I didn't want\\need to change my feelings",
                        " I'm not sure",
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -2
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much did you try to stay away from or be less involved in situations that would make you anxious or scared? \n\nAn example might be: If your teacher asked a question to the class and you knew the answer, do you not answer so you won't draw attention to yourself? \n\n0 = I tried to stay away from doing anything and everything that would make me anxious or scared. \n\n10 = If there was something that would make me anxious or scared, I pushed myself to do it anyway."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": 0,
                    "Maximum": 10,
                    "OtherChoices": [
                        "Nothing happened that made me anxious",
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -3
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "In this exercise, please think of an UPCOMING situation that you expect will make you feel anxious, worried, or scared. Pick a situation that you worry might go badly, or that you expect will bring on feelings of anxiety (like racing heart, sweating). Any situation that will make you feel quite anxious or scared will work, as long as it is a situation that is likely to actually happen."
            ],
            "Type": "Single",
            "Number": -4
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please describe the situation in a few words:"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -5
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please imagine the situation as vividly as possible (i.e., so that it feels very real). Try to imagine you are actually in the situation. Play out the specific parts of the situation in your head. Try to imagine using all your senses while you think about this situation. Think about the things you would see, hear, and smell if you were really in that situation. Think about the kinds of things you would think or feel if you were actually there."
            ],
            "Type": "Single",
            "Number": -6
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Play this situation in your head for the next 20 seconds. The screen will change automatically after 20 seconds"
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": 20
                }
            },
            "Number": -7
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How anxious did you feel (at the highest level of anxiety) as you completed the imagery task?  \n\n0 = Absolutely no anxiety. \n\n10 = Totally anxious."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": 0,
                    "Maximum": 10,
                    "OtherChoices": [
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -8
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How vividly did you imagine the situation?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Buttons",
                "Parameters": {
                    "Items": [
                        "Not at all vivid",
                        "Somewhat vivid",
                        "Moderately vivid",
                        "Very vivid",
                        "Totally vivid",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -9
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How likely is it that the situation or task will turn out well versus turn out badly?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Buttons",
                "Parameters": {
                    "Items": [
                        "Very likely to turn out well",
                        "Somewhat likely to turn out well",
                        "Neutral",
                        "Somewhat likely to turn out badly",
                        "Very likely to turn out badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -10
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "If this situation did turn out badly, how well or badly would you be able to handle it?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Buttons",
                "Parameters": {
                    "Items": [
                        "Very well",
                        "Somewhat well",
                        "Neutral",
                        "Somewhat badly",
                        "Very badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -11
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "On the next screen, you will be asked to write about a possible upcoming event in your life, or something that you are worried might happen. Before pressing NEXT, please think about a situation that might happen over the next week when you will feel anxious, scared, or worried. This can be a situation that makes you anxious a lot, or something that doesn't happen a lot. \n\nAs you think of an event, try to really see yourself in the situation. Where are you? What day of the week is it? What time is it? Who is around you? What are you doing? How do you feel?  \n\nAfter you come up with your situation, please press NEXT.  \n\nExamples could include taking a test, talking to strangers, using social media, dealing with family or friends, or whatever makes you feel anxious."
            ],
            "Type": "Single",
            "Number": -12
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please take a moment to write one or two sentences to describe the situation. Press next when you are ready to continue."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -13
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "For the next 30 seconds, please picture yourself in this situation. When you are finished, the screen will change automatically."
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": 30
                }
            },
            "Number": -14
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Now, take the next 90 seconds to think of as many different thoughts that you could have in the situation as you can. These thoughts can be negative or positive. Be as creative as possible with all of the different thoughts you could have while you're in the situation that makes you anxious, especially thoughts that would help you feel less anxious.  \n\nPlease type each of the thoughts in the box below. You can put each thought on a new line. \n\nThe screen will change after 90 seconds. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry",
                "Parameters": {
                    "Duration": 90
                }
            },
            "Number": -15
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job! You predicted the future! Now, if your situation happens over the next week, you can have a lot of different thoughts come into your mind. Try to remember some of your thoughts that make you feel less anxious!"
            ],
            "Type": "Single",
            "Number": -16
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job practicing flexible thinking today. Remember, try to use your new flexible thinking skills before your next training session!"
            ],
            "Type": "Single",
            "Number": -17
        }
    ],
    "Domains": [
        {
            "Name": "Academics",
            "Title": "Academics",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet."
                    ],
                    "Caption": "Answering a question"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "My answer was thoughtful. ",
                        "It was nice to be able to share what I think about the book.",
                        "My classmates are judging my wrong answer. ",
                        "My answer sounded dumb because I didn't understand the book, but no one will remember tomorrow.",
                        "If my English teacher didn't call on me, I wouldn't have made a fool of myself. I'll have a better answer next time. "
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I'm glad my teacher gave me the opportunity to share my answer. ",
                        "I'm satisfied with how I said my answer. ",
                        "I was scared while answering",
                        "I'm disappointed in myself because I couldn't say what I wanted to say, but I think my teacher understood my point. ",
                        "I was really anxious while I was answering, but was able to manage my feelings."
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I think about my answer, smile, and sit back. ",
                        "I'll review my notes from this book before my test.",
                        "I won't answer again in class. ",
                        "I feel like I should crack a joke so my friends forget about my answer, but don't.",
                        "I want to cry, but I take a moment to calm down and focus on the teacher's next question. "
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go."
                    ],
                    "Caption": "Important test"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "I'm a good student. ",
                        "I'll do my best on my test next week. ",
                        "My parents will be upset if I don't do well. ",
                        "I'm dumb for not understanding this material, but I bet if I study really hard I can learn some of the material.",
                        "I'll fail this test, but that doesn't mean I'll fail the class. "
                    ],
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I'm confident that I can study really hard for the test. ",
                        "I feel good about how I've done well in the class so far. ",
                        "I'm scared to take the test. ",
                        "I'm embarrassed to ask for help, but that feeling will pass. ",
                        "I'm nervous for my test next week, but I'll be able to handle it. "
                    ],
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I'll ask questions in class when I don't understand something this week.",
                        "I'll ask my teacher for help this week. ",
                        "I'll avoid studying for the test when I feel anxious. ",
                        "I want to avoid asking for help, but I reach out to my teacher anyway. ",
                        "I really don't want to make flash cards, but I will anyway because I know it'll be helpful for the test. "
                    ],
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a science test next week that's going to count for a lot of your grade. You haven't understood this unit's course material that well and you wonder how the test is going to go.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. "
                    ],
                    "Caption": "Aging grandfather"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "I wonder how my grandfather is feeling. ",
                        "He's happy to see me. ",
                        "My grandfather must be dying.",
                        "I think about how miserable I would be if he passes away, but then remind myself to enjoy my time with him today. ",
                        "My family must be keeping a secret about his health, but then tell myself that everyone ages. "
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I feel happy to see my grandfather.",
                        "I feel excited to catch him up on all the new things that are going on in my life. ",
                        "I'm worried about how he looks. ",
                        "I'm scared to lose him, but know that I can handle grief. ",
                        "I feel anxious about his health, but tolerate the anxiety. "
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I decide to give him a big hug and smile. ",
                        "I make a funny joke to get my grandparents laughing. ",
                        "I make a concerned face at my family. ",
                        "I want to leave and cry, but decide to stay with the family and engage in conversation. ",
                        "I gently ask my grandfather how he's doing and accept any answer he gives me."
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        },
        {
            "Name": "Social situations",
            "Title": "Social situations",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic3.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend."
                    ],
                    "Caption": "Sitting on the bus"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "I'm able to sit here alone for the rest of the ride. ",
                        "My friend probably had something to talk about with the other friend. ",
                        "My friend walked past me on purpose. ",
                        "It feels like my friend is mad at me, but they would have said something. ",
                        "I really don't like sitting alone, but I know I can handle this short bus ride. "
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I'm excited to see my other friends at school today. ",
                        "I'm glad that this is a short bus ride. ",
                        "I'm annoyed with my friend right now. ",
                        "I'm scared that people will judge me, but I can turn and talk to the people around me.",
                        "I am anxious about why my friend walked past me, but I can ask them about it later."
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I call out to my friend and smile. ",
                        "I turn to the seat behind me and start to make a joke. ",
                        "I start to cry. ",
                        "I'll want to ignore my friend the rest of the day, but I'll be nice since that's the right thing to do. ",
                        "I want to put my head between my knees and disappear, but I take a deep breath and smile. "
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic4.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt."
                    ],
                    "Caption": "Spilled slushie"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "I think about how this is a common accident. ",
                        "I think about how it will be a funny story. ",
                        "I think I will look silly in front of everyone. ",
                        "I'm annoying to my friends right now, but they will understand that accidents happen.",
                        "I'm causing a scene, but the other people here don't know me or care about this situation. "
                    ],
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I'm feeling silly and decide to chuckle about it. ",
                        "I'm glad that this is an old shirt. ",
                        "I feel embarrassed and it's making me want to leave the mall. ",
                        "I'm so annoyed with myself, but am able to get past this feeling. ",
                        "I'm self-conscious with this stain, but no one else will care. "
                    ],
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I wipe up the slushie, smile, and keep shopping with my friends. ",
                        "I laugh and buy another slushie. ",
                        "I'll cry and leave the mall. ",
                        "I want to leave immediately, but know that I'll forget about the stain soon. ",
                        "I want to throw away the slushie, but decide to keep eating it. "
                    ],
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You and your friends are shopping at the mall. You go to the food court and get slushies, and accidentally spill your red slushie down the front of your new white shirt.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic5.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet."
                    ],
                    "Caption": "Answering a question"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "My answer was thoughtful. ",
                        "It was nice to be able to share what I think about the book.",
                        "My classmates are judging my wrong answer. ",
                        "My answer sounded dumb because I didn't understand the book, but no one will remember tomorrow.",
                        "If my English teacher didn't call on me, I wouldn't have made a fool of myself. I'll have a better answer next time. "
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I'm glad my teacher gave me the opportunity to share my answer. ",
                        "I'm satisfied with how I said my answer. ",
                        "I was scared while answering",
                        "I'm disappointed in myself because I couldn't say what I wanted to say, but I think my teacher understood my point. ",
                        "I was really anxious while I was answering, but was able to manage my feelings."
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I think about my answer, smile, and sit back. ",
                        "I'll review my notes from this book before my test.",
                        "I won't answer again in class. ",
                        "I feel like I should crack a joke so my friends forget about my answer, but don't.",
                        "I want to cry, but I take a moment to calm down and focus on the teacher's next question. "
                    ],
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your English teacher calls on you to answer a question about the book you just read. You say your best answer and your peers are quiet.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        },
        {
            "Name": "Physical health",
            "Title": "Physical health",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic6.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath."
                    ],
                    "Caption": "Saying hi to friends"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "It is a nice day for a jog. ",
                        "That was a good jog. ",
                        "I feel like I'm going to die. ",
                        "I think I'm being judged by my friends for being out of breath, but they probably don't even notice. ",
                        "The tightness in my chest is really uncomfortable, but I know it'll go away soon. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I'm feel happy to see my friends. ",
                        "I feel invigorated. ",
                        "I'm worried I'm really sick because of the tightness in my chest. ",
                        "Even though I'm a little embarrassed that I'm out of breath when I see my friends, I know that they aren't judging me. ",
                        "Feeling out of breath reminds me of how I feel when I'm a little anxious, which is interesting to notice. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I smile when I see my friends. ",
                        "I ask how my friends are doing after I catch my breath. ",
                        "I tell my friends that I can't breath because of a health condition. ",
                        "I want to sit on the ground and avoid my friends, but I acknowledge my feelings and catch my breath. ",
                        "I think about calling my parent to make sure I'm not dying, but know that I'm actually ok. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic7.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly."
                    ],
                    "Caption": "Walking up stairs"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "I am happy to be on time. ",
                        "I feel like that was an impressive mini workout. ",
                        "I'm so out of shape. ",
                        "I want to think about how this could be an underlying condition, but tolerate the negative thoughts. ",
                        "I think about my heartbeat, and decide that is normal for how fast I was just going. "
                    ],
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I'm proud of myself for making myself a little uncomfortable. ",
                        "I'm glad that I was able to make it up the stairs so quickly.",
                        "I'm panicking that I'm going to die. ",
                        "Although I am worried about my health, I decide to focus on the moment with my teacher. ",
                        "I want to feel concerned about this situation, but shift my attention to the meeting. "
                    ],
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I smile at the teacher once I make it to the meeting. ",
                        "I breathe deeply and focus on calming myself. ",
                        "I ask my teacher if I could be having a heart attack. ",
                        "I feel the urge to look up my symptoms online, but remind myself that feeling this way is normal after going up a lot of stairs. ",
                        "I remind myself to take a few slow breaths to recenter my thoughts after I feel the urge to cry. "
                    ],
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are meeting with your teacher. To make it on-time, you just walked up two flights of stairs quickly, and feel your heart beating very rapidly.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic8.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend."
                    ],
                    "Caption": "Sitting on the bus"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "I'm able to sit here alone for the rest of the ride. ",
                        "My friend probably had something to talk about with the other friend. ",
                        "My friend walked past me on purpose. ",
                        "It feels like my friend is mad at me, but they would have said something. ",
                        "I really don't like sitting alone, but I know I can handle this short bus ride. "
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I'm excited to see my other friends at school today. ",
                        "I'm glad that this is a short bus ride. ",
                        "I'm annoyed with my friend right now. ",
                        "I'm scared that people will judge me, but I can turn and talk to the people around me.",
                        "I am anxious about why my friend walked past me, but I can ask them about it later."
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I call out to my friend and smile. ",
                        "I turn to the seat behind me and start to make a joke. ",
                        "I start to cry. ",
                        "I'll want to ignore my friend the rest of the day, but I'll be nice since that's the right thing to do. ",
                        "I want to put my head between my knees and disappear, but I take a deep breath and smile. "
                    ],
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are sitting on the bus and see your friend get on. They walk past you and sit with another friend.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        },
        {
            "Name": "Social media",
            "Title": "Social media",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic9.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. "
                    ],
                    "Caption": "Hanging out without you"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "The picture looks nice.",
                        "It seems like they are having a fun time. ",
                        "I wonder if I wasn't invited because they think I'm boring.",
                        "I think they may have forgotten about me, but next time they'll remember. ",
                        "I wonder if my friends actually don't like me, but then challenge myself to think of times when we've all had fun together. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I feel happy they are all together. ",
                        "I feel excited to hear about the fun that they had. ",
                        "I feel embarrassed that I wasn't invited. ",
                        "I'm sad that they forgot about me, but then tell myself that they probably didn't mean to be mean.",
                        "I'm worried that I've lost all of my friends, but the remind myself that's not realistic. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I post a nice comment on the picture. ",
                        "I message my friend and let them know I would love to hang out with them next time.",
                        "I decide to block my friends' accounts. ",
                        "I really want to ask my friends why I wasn't invited, but decide that I don't need to ask. ",
                        "I want to cry, but remind myself that I've hung out with some of those friends without everyone there. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic10.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you."
                    ],
                    "Caption": "Cute peer on social media"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "They must have liked my profile and decided to follow me.",
                        "I think about how they may want to be friends. ",
                        "I wonder if they thought my posts were dumb.",
                        "I think about whether they think my photos are silly, but then remind myself that I'm proud of my profile. ",
                        "I wonder if they think I am attractive, but remind myself that looks aren't everything. "
                    ],
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I feel happy that they followed me. ",
                        "I feel excited I have a new friend. ",
                        "I feel like they might unfollow me. ",
                        "I feel embarrassed by some pictures I have up, but decide to feel confident about them. ",
                        "I feel shy about them adding me, but decide to be excited about the add."
                    ],
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I comment on their photo. ",
                        "I tell my friend about how someone new added me. ",
                        "I delete all of the pictures that might be embarrassing",
                        "I want to deactivate my account, but decide to keep it up. ",
                        "I want to change some of my pictures, but keep them the same. "
                    ],
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You met a cute peer in one of your classes. After school, you notice that they started following you.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic11.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath."
                    ],
                    "Caption": "Saying hi to friends"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "It is a nice day for a jog. ",
                        "That was a good jog. ",
                        "I feel like I'm going to die. ",
                        "I think I'm being judged by my friends for being out of breath, but they probably don't even notice. ",
                        "The tightness in my chest is really uncomfortable, but I know it'll go away soon. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I'm feel happy to see my friends. ",
                        "I feel invigorated. ",
                        "I'm worried I'm really sick because of the tightness in my chest. ",
                        "Even though I'm a little embarrassed that I'm out of breath when I see my friends, I know that they aren't judging me. ",
                        "Feeling out of breath reminds me of how I feel when I'm a little anxious, which is interesting to notice. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I smile when I see my friends. ",
                        "I ask how my friends are doing after I catch my breath. ",
                        "I tell my friends that I can't breath because of a health condition. ",
                        "I want to sit on the ground and avoid my friends, but I acknowledge my feelings and catch my breath. ",
                        "I think about calling my parent to make sure I'm not dying, but know that I'm actually ok. "
                    ],
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are outside on a cool day and see your friends down the street. You decide to jog over to say hi. When you get to your friends, you feel out of breath.\n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        },
        {
            "Name": "Home life",
            "Title": "Home life",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic12.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. "
                    ],
                    "Caption": "Balancing responsibilities"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "I can manage both tasks.",
                        "I think this will help me organize thoughtfully in the future. ",
                        "I don't think I can manage all of these tasks. ",
                        "I hate feeling like I have so much to do, but I'll do my best to get it all done. ",
                        "I think this is too much work, but decide to think positively about the outcome."
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I'm excited to listen to my favorite artist while I do my chores.",
                        "I'm calm as I prioritize my chores and school work. ",
                        "I'm anxious about being able to get everything done. ",
                        "Although I feel overwhelmed, I try and feel grateful for being in school and for the home that I live in.",
                        "I feel upset about all I have to do, but I imagine how it will feel to have it all accomplished. "
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I decide to get started on the chores. ",
                        "I decide to start on the school project first.",
                        "I decide to sit and do nothing. ",
                        "I just want to be lazy and take a nap, but decide to start with one task. ",
                        "I want to avoid all of the tasks, but decide to make a schedule to help organize my time. "
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic13.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. "
                    ],
                    "Caption": "Can't afford a gift"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "I think my friend will be happy to see me. ",
                        "I'm looking forward to celebrating with friends. ",
                        "My friend will notice that I'm not able to bring a gift. ",
                        "I think I am a bad friend, but know showing up is what counts. ",
                        "I assume everyone brought a gift, but I don't actually know if that's true."
                    ],
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I feel grateful to be invited. ",
                        "I feel excited to get the party started. ",
                        "I feel sad that I didn't bring a gift.",
                        "I feel ashamed, but decide that material things are not as important as friendship. ",
                        "I feel guilty about coming empty-handed, but remind myself that my friend probably won't notice. "
                    ],
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I stay at the party. ",
                        "I walk in and hug my friend. ",
                        "I decide to stay for an hour and leave. ",
                        "I want to leave before the presents are opened, but decide to stay. ",
                        "I think about lying that I forgot the gift at home, but remember that I should always tell the truth."
                    ],
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "Your friend is having a huge birthday party and most of the people in your grade will be there. You know you can't afford a gift for your friend. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic14.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. "
                    ],
                    "Caption": "Hanging out without you"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "The picture looks nice.",
                        "It seems like they are having a fun time. ",
                        "I wonder if I wasn't invited because they think I'm boring.",
                        "I think they may have forgotten about me, but next time they'll remember. ",
                        "I wonder if my friends actually don't like me, but then challenge myself to think of times when we've all had fun together. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I feel happy they are all together. ",
                        "I feel excited to hear about the fun that they had. ",
                        "I feel embarrassed that I wasn't invited. ",
                        "I'm sad that they forgot about me, but then tell myself that they probably didn't mean to be mean.",
                        "I'm worried that I've lost all of my friends, but the remind myself that's not realistic. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I post a nice comment on the picture. ",
                        "I message my friend and let them know I would love to hang out with them next time.",
                        "I decide to block my friends' accounts. ",
                        "I really want to ask my friends why I wasn't invited, but decide that I don't need to ask. ",
                        "I want to cry, but remind myself that I've hung out with some of those friends without everyone there. "
                    ],
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You are looking through your social media app and see a number of your friends have posted to their stories. As you look through their photos, you realize that a few of your close friends were all hanging out without you. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        },
        {
            "Name": "General",
            "Title": "General",
            "Scenarios": [
                {
                    "Number": -10,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Next, you're going to see a scenario that might make you anxious. As you read the short story, picture yourself in that situation. After you picture yourself in the situation, click \"Next\" and then you'll see examples of thoughts, feelings, and behaviors that might happen in that situation. \n\n Some of the thoughts, feelings, and behaviors will be helpful and some won't be. "
                    ]
                },
                {
                    "Number": -9,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "The goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. \n\n After you see some thoughts, you'll be asked to write your own example of a helpful thought that you might have in that situation. You'll do the same thing for feelings and behaviors."
                    ]
                },
                {
                    "Number": -8,
                    "Name": "Long Scenarios",
                    "Title": "Long Scenarios",
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic15.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. "
                    ],
                    "Caption": "Aging grandfather"
                },
                {
                    "Number": 1.1,
                    "Name": "Scenario 1 Thoughts",
                    "Title": "Scenario 1 Thoughts",
                    "Words": [
                        "I wonder how my grandfather is feeling. ",
                        "He's happy to see me. ",
                        "My grandfather must be dying.",
                        "I think about how miserable I would be if he passes away, but then remind myself to enjoy my time with him today. ",
                        "My family must be keeping a secret about his health, but then tell myself that everyone ages. "
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 1.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 1.2,
                    "Name": "Scenario 1 Feelings",
                    "Title": "Scenario 1 Feelings",
                    "Words": [
                        "I feel happy to see my grandfather.",
                        "I feel excited to catch him up on all the new things that are going on in my life. ",
                        "I'm worried about how he looks. ",
                        "I'm scared to lose him, but know that I can handle grief. ",
                        "I feel anxious about his health, but tolerate the anxiety. "
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\nPlease take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 1.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 1.3,
                    "Name": "Scenario 1 Behaviors",
                    "Title": "Scenario 1 Behaviors",
                    "Words": [
                        "I decide to give him a big hug and smile. ",
                        "I make a funny joke to get my grandparents laughing. ",
                        "I make a concerned face at my family. ",
                        "I want to leave and cry, but decide to stay with the family and engage in conversation. ",
                        "I gently ask my grandfather how he's doing and accept any answer he gives me."
                    ],
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 1.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 1.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You go to your grandparents' home for the first time in a while and notice that your grandfather looks a lot less healthy than you remember. No one in your family mentions it. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 1.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! You've completed the first of three training exercises. Next you'll do the same exercise with a new story. \n\nAgain, the goal of this exercise is to help you learn that there are lots of different reactions that you might have in a scary situation, and not all of these thoughts, feelings, and behaviors have to be negative. "
                    ]
                },
                {
                    "Number": 1.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic16.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. "
                    ],
                    "Caption": "Missing spider"
                },
                {
                    "Number": 2.1,
                    "Name": "Scenario 2 Thoughts",
                    "Title": "Scenario 2 Thoughts",
                    "Words": [
                        "It's probably not coming back.",
                        "I think it was afraid of me. ",
                        "It's probably on me!",
                        "I think about all of the places the spider could be, but decide it doesn't matter. ",
                        "I think about how scary the spider looked, but realized how small it really was. "
                    ],
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.11,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 2.12,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.13,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 2.2,
                    "Name": "Scenario 2 Feelings",
                    "Title": "Scenario 2 Feelings",
                    "Words": [
                        "I'm happy the spider is gone.",
                        "I'm eager to get my shower over with. ",
                        "I feel worried about where the spider may be crawling. ",
                        "I'm nervous about the spider, but remind myself that it probably is more scared of me.",
                        "I feel freaked out, but know that I'm brave enough to take my shower anyway. "
                    ],
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 2.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 2.3,
                    "Name": "Scenario 2 Behaviors",
                    "Title": "Scenario 2 Behaviors",
                    "Words": [
                        "I take a shower. ",
                        "I go on with my bathroom routine. ",
                        "I leave the bathroom and do not take a shower. ",
                        "I want to run away, but know I can face my fear. ",
                        "I want to scream, but tell myself the spider is harmless. "
                    ],
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 2.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "As you're getting into the shower, you see a huge spider on the wall. You turn away for a second and look back and realize it's gone. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 2.33,
                    "Type": "Single",
                    "Description": [
                        "Way to go! Now you just have one training exercise left. You're going to practice coming up with thoughts, feelings, and behaviors one more time, and this time the story is going to be from a different topic than the first two you just did. This is to help your brain practice this kind of thinking in lots of different types of situations. "
                    ]
                },
                {
                    "Number": 2.34,
                    "Type": "Single",
                    "Description": [
                        "Picture yourself in the situation on the next page."
                    ]
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Type": "Single",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session1_long/pic17.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. "
                    ],
                    "Caption": "Balancing responsibilities"
                },
                {
                    "Number": 3.1,
                    "Name": "Scenario 3 Thoughts",
                    "Title": "Scenario 3 Thoughts",
                    "Words": [
                        "I can manage both tasks.",
                        "I think this will help me organize thoughtfully in the future. ",
                        "I don't think I can manage all of these tasks. ",
                        "I hate feeling like I have so much to do, but I'll do my best to get it all done. ",
                        "I think this is too much work, but decide to think positively about the outcome."
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some thoughts that might pop into mind: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now's your chance to be creative! What could you say to yourself to make you feel better in this situation?  \n\nFor the next 30 seconds, write as many different thoughts that you might have that would be helpful in this situation. You can use the thoughts that you saw a moment ago for inspiration, or can list things that you've told yourself in the past that have helped. \n\nWhat could you tell yourself in this situation that would help you feel less anxious or would help you handle your feelings of anxiety?"
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nThoughts in the moment: "
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some feelings."
                    ]
                },
                {
                    "Number": 3.2,
                    "Name": "Scenario 3 Feelings",
                    "Title": "Scenario 3 Feelings",
                    "Words": [
                        "I'm excited to listen to my favorite artist while I do my chores.",
                        "I'm calm as I prioritize my chores and school work. ",
                        "I'm anxious about being able to get everything done. ",
                        "Although I feel overwhelmed, I try and feel grateful for being in school and for the home that I live in.",
                        "I feel upset about all I have to do, but I imagine how it will feel to have it all accomplished. "
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some feelings that might happen in the moment: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.21,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Now you try! What are some feelings that you could have in the moment? These don't have to only be feelings that you've had in the past or negative feelings that you assume you'd have in the moment. Think creatively about both positive and negative feelings that may come up for you in reaction to the situation. If you write a negative feeling, try to also write how you might cope with that feeling. \n\n Please take 30 seconds to write as many different feelings that you could imagine having in this situation. You can be as creative as you want. If you write any negative feelings (like scared or anxious), try to also write how you could help yourself feel better in the moment. "
                    ]
                },
                {
                    "Number": 3.22,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nFeelings in the moment and how you'd handle any negative feelings:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.23,
                    "Type": "Single",
                    "Description": [
                        "Great job! Now you'll see some behaviors."
                    ]
                },
                {
                    "Number": 3.3,
                    "Name": "Scenario 3 Behaviors",
                    "Title": "Scenario 3 Behaviors",
                    "Words": [
                        "I decide to get started on the chores. ",
                        "I decide to start on the school project first.",
                        "I decide to sit and do nothing. ",
                        "I just want to be lazy and take a nap, but decide to start with one task. ",
                        "I want to avoid all of the tasks, but decide to make a schedule to help organize my time. "
                    ],
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nHere are some behaviors that someone might do at that moment or in the future: "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3.31,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Type": "Single",
                    "Description": [
                        "Your turn! Now it's up to you to write down as many behaviors as you can that might be helpful in the moment. Remember, avoiding or leaving the situation might feel better in the moment, but actually makes anxiety worse in the future! Try to think about behaviors that you can do in the moment that would allow you to stay in the situation. What could you do in the situation that allows you to push through anxiety? \n\nPlease take 30 seconds to write as many behaviors that you could do in the moment that would be helpful and make you feel less anxious in the future."
                    ]
                },
                {
                    "Number": 3.32,
                    "Name": "Be creative!",
                    "Title": "Be creative!",
                    "Description": [
                        "You have a lot of chores that you have to do tonight, and you also have a big project that's due tomorrow. Both have to get done, and you think about how you'll handle it all. \n\nBehaviors you might do in the moment:"
                    ],
                    "Type": "Single",
                    "Input": {
                        "Type": "Entry",
                        "Parameters": {
                            "Duration": 30
                        }
                    }
                },
                {
                    "Number": 3.33,
                    "Type": "Single",
                    "Description": [
                        "Excellent work! Now you'll do a Quick Thinking exercise and then you'll be done for today. "
                    ]
                }
            ]
        }
    ],
    "AfterDomain": [
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "On the next screen, you'll see a situation that might make someone nervous, worried, scared, or anxious. Here's an example:\n\nYou're out with friends and receive this message from your parent saying, \"You need to come home right now.\""
            ],
            "Type": "Single",
            "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/quickthinking/pic0.jpeg",
            "ImageType": "image/jpeg",
            "ImageEmbedded": "true",
            "ImageFromUrl": "true",
            "Number": 100
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "In the text box, please write as many different thoughts that might come to your mind in that moment. You can add each thought to a new line. You'll have 60 seconds to do this. \n\nFor this example, you might write: \nWhat did I do wrong? \n My parent has something really important to tell me. \n I'm really tired, so I'm glad to be going home. \n\nThe screen will automatically change after 60 seconds. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": 60
                }
            },
            "Number": 101
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "You don't need to write full sentences, and you should push yourself to write as many different thoughts as possible! These can be a mix of positive and negative thoughts. To add another thought, press the Submit button on your screen."
            ],
            "Type": "Single",
            "Number": 102
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "Your teacher is about to hand back graded tests from last week, and you remember how hard the test was."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/quickthinking/pic1.jpeg",
            "ImageType": "image/jpeg",
            "ImageEmbedded": "true",
            "ImageFromUrl": "true",
            "Number": 103
        },
        {
            "Name": "Wrapping Up",
            "Title": "Wrapping Up",
            "Description": [
                "Great job practicing flexible thinking today. Remember, try to use your new flexible thinking skills before your next training session!"
            ],
            "Type": "Single",
            "Number": 104
        }
    ]
}