{
    "Number": 5,
    "Name": "Session5_long",
    "Title": "Week 5: Part 2",
    "TimeToComplete": "00:05:00",
    "BeforeDomain": [
        {
            "Name": "Welcome Back!",
            "Title": "Welcome Back!",
            "Description": [
                "Welcome back to MindTrails! Let's get started with practicing flexible thinking. Today, you will: answer a few questions about your anxiety, complete 3 scenarios that challenge you to come up with thoughts, feelings, and behaviors, and wrap-up with a Quick Thinking exercise. Let's get started! As a reminder, this is your last training session! Great job making it this far."
            ],
            "Type": "Single",
            "Number": 0
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how anxious have you felt? 0 = Most calm I could imagine being. 10 = Most anxious, panicked, or scared I could imagine being."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -1
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much were you able to change the way you thought about things when you wanted to feel better. (An example might be: If you were feeling worried about an upcoming test, were you able to think about how much you studied, so that you felt less worried?) 0 = Not at all -- I wasn't able to think in different ways to feel better. 10 = Completely-- I was totally able to think in different ways to feel better. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "I didn't want/need to change how I was feeling",
                        "I'm not sure, or I wasn't paying attention to my feeling.",
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -2
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much did you try to stay away from or be less involved in situations that would make you anxious or scared? (An example might be: If your teacher asked a question to the class and you knew the answer, do you not answer so you won't draw attention to yourself?) 0 = I tried to stay away from doing anything and everything that would make me anxious or scared. 10 = If there was something that would make me anxious or scared. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "I pushed myself to do it anyway or I didn't have anything that would make me anxious or scared in the last 24 hours.",
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -3
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "In this exercise, please think of an UPCOMING situation that you expect will make you feel anxious, worried, or scared. Pick a situation that you worry might go badly, or that you expect will bring on feelings of anxiety (like racing heart, sweating). Any situation that will make you feel quite anxious or scared will work, as long as it is a situation that is likely to actually happen."
            ],
            "Type": "Single",
            "Number": -4
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please describe the situation in a few words:"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -5
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How anxious did you feel (at the highest level of anxiety) as you completed the imagery task?  0 = Absolutely no anxiety. 10 = Totally anxious."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "Prefer not to answer."
                    ]
                }
            },
            "Number": -6
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How vividly did you imagine the situation?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Not at all vivid",
                        "Somewhat vivid",
                        "Moderately vivid",
                        "Very vivid",
                        "Totally vivid",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -7
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How likely is it that the situation or task will turn out well versus turn out badly?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Very likely to turn out well",
                        "Somewhat likely to turn out well",
                        "Neutral",
                        "Somewhat likely to turn out badly",
                        "Very likely to turn out badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -8
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "If this situation did turn out badly, how well or badly would you be able to handle it?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Very well",
                        "Somewhat well",
                        "Neutral",
                        "Somewhat badly",
                        "Very badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -9
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "On the next screen, you will be asked to write about a possible upcoming event in your life, or something that you are worried might happen. Before pressing NEXT, please think about a situation that might happen over the next week when you will feel anxious, scared, or worried. This can be a situation that makes you anxious a lot, or something that doesn't happen a lot. As you think of an event, try to really see yourself in the situation. Where are you? What day of the week is it? What time is it? Who is around you? What are you doing? How do you feel? After you come up with your situation, please press NEXT. Examples could include taking a test, talking to strangers, using social media, dealing with family or friends, or whatever makes you feel anxious."
            ],
            "Type": "Single",
            "Number": -10
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please take a moment to write one or two sentences to describe the situation. Press next when you are ready to continue."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -11
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "For the next 30 seconds, please picture yourself in this situation. When you are finished, the screen will change automatically."
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": "30"
                }
            },
            "Number": -12
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Now, take the next 90 seconds to think of as many different thoughts that you could have in the situation as you can. These thoughts can be negative or positive. Be as creative as possible with all of the different thoughts you could have while you're in the situation that makes you anxious, especially thoughts that would help you feel less anxious."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry",
                "Parameters": {
                    "Duration": "90"
                }
            },
            "Number": -13
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job! You predicted the future! Now, if your situation happens over the next week, you can have a lot of different thoughts come into your mind. Try to remember some of your thoughts that make you feel less anxious!"
            ],
            "Type": "Single",
            "Number": -14
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job practicing flexible thinking today. Remember, try to use your new flexible thinking skills before your next training session!"
            ],
            "Type": "Single",
            "Number": -15
        }
    ],
    "Domains": [
        {
            "Name": "Academics",
            "Title": "Academics",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're working on your math homework with a few friends and get stuck on a problem. Your friend suggests that you find the answer online, but that's considered cheating on the assignment. "
                    ],
                    "Words": [
                        "I can get great answers all on my own.",
                        "I think that this will be better if i don't cheat and actually learn the material. ",
                        "I'll get a bad grade if I don't cheat. ",
                        "I feel like I may not get the best grade on the assignment, but at least I didn't cheat.",
                        "I feel like my teacher will not be okay with me getting wrong answers, but it is a part of learning. ",
                        "I'll feel so proud that I did the homework on my own if I don't cheat",
                        "I'll be pretty confident knowing I can do hard homework problems next time. ",
                        "I am upset at my friends wanting me to take the easy way out. ",
                        "I'm nervous about attempting to do this problem on my own, but give it a try anyway.",
                        "I feel embarrassed about not wanting to cheat, but know my friends will look up to me if I don't. ",
                        "I give suggest doing the problem without cheating. ",
                        "I am enthusiastic about trying new ways to figure out the answer. ",
                        "I cheat off of my friend's homework.",
                        "I want to cheat so that this assignment is done, but keep trying anyway. ",
                        "I am tempted to ask them what it said online, but decide not to. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Friends cheating"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your teacher tells your class that tomorrow you'll divide into small groups to discuss the book you're reading. She also says that you'll have to pick your group, but you realize you don't have any close friends in the class. "
                    ],
                    "Words": [
                        "I'll meet the right group for me.",
                        "There are lots of nice kids in this class. ",
                        "No one will want to be in my group. ",
                        "Everyone will decide they want to be with people they already know, but I understand that. ",
                        "No one will want to give me a chance, but I realize that there will be some people who will want to get to know me. ",
                        "I feel driven to put my best work in. ",
                        "I am excited to make new friends.",
                        "I am nervous no one will want to get to know me. ",
                        "I feel sad that no one knows me that well, but feel better thinking they will like me once they do. ",
                        "I am scared I will end up alone, but know that there will be a group that needs an extra person. ",
                        "I will talk to people in class and ask to be in a group. ",
                        "I'll express how excited I am to get to know everyone. ",
                        "I'll go to the bathroom so that I don't have to ask anyone to be in their group. ",
                        "I'll want to say I want to work alone, but give the group a try. ",
                        "I want to stay quiet, but decide to contribute. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Group discussion"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are invited to a Halloween party and you will only know a couple of people there. You decide to wear a really elaborate costume. When you arrive, everyone looks at you. "
                    ],
                    "Words": [
                        "I think this costume is fun. ",
                        "Everyone will love this costume. ",
                        "No one likes my costume. ",
                        "I may have worn something too crazy, but I like it. ",
                        "Maybe I should have toned it down, but know that this is true to myself. ",
                        "I feel happy wearing what I love.",
                        "I feel so liberated wearing something so fun. ",
                        "I'm worried that others are making fun of me behind my back. ",
                        "I'm really embarrassed that I stand out so much, but honestly people will forget about it in a few minutes. ",
                        "I worry about what others are thinking, but realize that I'm allowed to wear what makes me happy.",
                        "I will smile and wear my outfit proudly.",
                        "I'll start dancing because there's great music on. ",
                        "I want to go to the bathroom and try to tone down what I'm wearing. ",
                        "I want to start crying, but then remind myself I did a great job on this costume. ",
                        "I want to ask someone if my costume is too much, but decide not to ask for opinions. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Halloween party"
                }
            ]
        },
        {
            "Name": "Social situations",
            "Title": "Social situations",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are invited to a Halloween party and you will only know a couple of people there. You decide to wear a really elaborate costume. When you arrive, everyone looks at you. "
                    ],
                    "Words": [
                        "I think this costume is fun. ",
                        "Everyone will love this costume. ",
                        "No one likes my costume. ",
                        "I may have worn something too crazy, but I like it. ",
                        "Maybe I should have toned it down, but know that this is true to myself. ",
                        "I feel happy wearing what I love.",
                        "I feel so liberated wearing something so fun. ",
                        "I'm worried that others are making fun of me behind my back. ",
                        "I'm really embarrassed that I stand out so much, but honestly people will forget about it in a few minutes. ",
                        "I worry about what others are thinking, but realize that I'm allowed to wear what makes me happy.",
                        "I will smile and wear my outfit proudly.",
                        "I'll start dancing because there's great music on. ",
                        "I want to go to the bathroom and try to tone down what I'm wearing. ",
                        "I want to start crying, but then remind myself I did a great job on this costume. ",
                        "I want to ask someone if my costume is too much, but decide not to ask for opinions. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Halloween party"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are hanging out at your friend's house and go to use the restroom. When you reenter the room your friends are in, they stop their conversation and it's silent. "
                    ],
                    "Words": [
                        "I think I must have made a big entrance. ",
                        "Everyone must be noticing my new outfit. ",
                        "Everyone is talking about me. ",
                        "Do my friends have something bad to tell me? That's just me overthinking. ",
                        "They must have something to tell me, it doesn't mean it's negative. ",
                        "I'm thankful for the friends that I have. ",
                        "I am interested to join in on the conversation. ",
                        "I feel defensive. ",
                        "I'm worried that they could hear me in the bathroom, but then remember that everyone uses the bathroom so it isn't a big deal.",
                        "I am uncomfortable being around them, but I know that these are my close friends and start to calm down. ",
                        "I'll smile at all of them. ",
                        "I'll wave my hands in a grand gesture. ",
                        "I'll give them a weird look. ",
                        "I want to head home early, but decide to stay as long as everyone else. ",
                        "I'll want to text on my phone to avoid talking to them, but remain engaged with my friends. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Using the restroom"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're at a new grocery store with your parent and you're looking for bread. Suddenly you notice that your heart is beating quickly and pounding. "
                    ],
                    "Words": [
                        "I like the challenge of finding our favorite foods at this new store. ",
                        "I probably feel my heart beating because I'm excited to try this new store. ",
                        "I must be having a panic attack!",
                        "My heartbeat is distracting me from looking for the bread, but it'll go away soon. ",
                        "I wonder if I'm really sick, but then tell myself that this feeling won't last forever. ",
                        "I'm happy that my parent finally brought me here. ",
                        "I'm excited to see what this new grocery store has. ",
                        "I'm terrified that my heart pounding means that I'm going to die. ",
                        "I'm scared about this feeling in my chest, but know that it will pass. ",
                        "I'm nervous about my heart, but remember that sometimes my heart beats quickly when I'm excited. ",
                        "I ask my parent to help me find the bread. ",
                        "I notice the feeling in my chest and keep walking down the aisles. ",
                        "I ask my parent to take me to the hospital immediately. ",
                        "I notice my pounding heart and remind myself that this feeling doesn't necessarily mean anything is wrong with me. ",
                        "I can ask my parent about my beating heart if it happens again in the future. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "New grocery store"
                }
            ]
        },
        {
            "Name": "Physical health",
            "Title": "Physical health",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're at a new grocery store with your parent and you're looking for bread. Suddenly you notice that your heart is beating quickly and pounding. "
                    ],
                    "Words": [
                        "I like the challenge of finding our favorite foods at this new store. ",
                        "I probably feel my heart beating because I'm excited to try this new store. ",
                        "I must be having a panic attack!",
                        "My heartbeat is distracting me from looking for the bread, but it'll go away soon. ",
                        "I wonder if I'm really sick, but then tell myself that this feeling won't last forever. ",
                        "I'm happy that my parent finally brought me here. ",
                        "I'm excited to see what this new grocery store has. ",
                        "I'm terrified that my heart pounding means that I'm going to die. ",
                        "I'm scared about this feeling in my chest, but know that it will pass. ",
                        "I'm nervous about my heart, but remember that sometimes my heart beats quickly when I'm excited. ",
                        "I ask my parent to help me find the bread. ",
                        "I notice the feeling in my chest and keep walking down the aisles. ",
                        "I ask my parent to take me to the hospital immediately. ",
                        "I notice my pounding heart and remind myself that this feeling doesn't necessarily mean anything is wrong with me. ",
                        "I can ask my parent about my beating heart if it happens again in the future. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "New grocery store"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "A friend tells a funny joke and you start to laugh really hard. While you're laughing, you feel an uncomfortable tightness in your chest that you've never felt before.  "
                    ],
                    "Words": [
                        "I've never laughed that hard. ",
                        "That's the funniest joke I've ever heard.",
                        "I can't catch my breath!",
                        "This tightness is really uncomfortable, but it'll go away soon. It must have been from laughing really hard. ",
                        "I wish this feeling in my chest would go away, but I can stand it until it does. ",
                        "I love it when my friends make me laugh. ",
                        "I'm shocked that my friend is that funny!",
                        "I'm really scared about what this feeling means. ",
                        "I'm nervous about why my chest is tight, but it'll go away. ",
                        "I'm anxious that this feeling means something's wrong with me, but then remind myself that it's probably from laughing really hard. ",
                        "I take a deep breath and remember the joke for later. ",
                        "I notice the feeling in my chest and tell my friend that's the best joke I've ever heard. ",
                        "I immediately start to look up online what this feeling means. ",
                        "Even though it isn't easy, I tell myself that this tight feeling will go away. ",
                        "I want to go be alone and figure out why I'm feeling so bad, but remind myself that this tightness is probably from laughing and it will go away. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Laughing at a joke"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your friends took some pictures together. You look through your feed and see that they tagged you in a post. You don't like how you look in the picture."
                    ],
                    "Words": [
                        "I'm glad they posted a picture of all of us. ",
                        "I don't think anyone will notice how I look.",
                        "Others may point out how I look in the picture. ",
                        "I don't think this is the best post, but am OK with that. ",
                        "I think that my friend could've posted a better picture, but I know they didn't really mean to put up a bad one of me. ",
                        "I feel happy it is a group photo. ",
                        "I'm proud of the outfit in the picture. ",
                        "I'm embarrassed by the face I'm making in the photo. ",
                        "I'm annoyed that such a bad photo of me was posted, but remind myself that this isn't the end of the world. ",
                        "I feel like everyone else looks better than me, but realize that is irrational thinking.",
                        "I post a photo from a few weeks ago where I really like how I look. ",
                        "I tell my friend it was a good idea to post a picture of everyone.",
                        "I leave a comment about how embarrassed I am. ",
                        "I want to pretend the picture doesn't exist, but decide it is fine. ",
                        "I want to ask my friends if they think I look okay, but decide I look fine on my own."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Tagged in a photo"
                }
            ]
        },
        {
            "Name": "Social media",
            "Title": "Social media",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your friends took some pictures together. You look through your feed and see that they tagged you in a post. You don't like how you look in the picture."
                    ],
                    "Words": [
                        "I'm glad they posted a picture of all of us. ",
                        "I don't think anyone will notice how I look.",
                        "Others may point out how I look in the picture. ",
                        "I don't think this is the best post, but am OK with that. ",
                        "I think that my friend could've posted a better picture, but I know they didn't really mean to put up a bad one of me. ",
                        "I feel happy it is a group photo. ",
                        "I'm proud of the outfit in the picture. ",
                        "I'm embarrassed by the face I'm making in the photo. ",
                        "I'm annoyed that such a bad photo of me was posted, but remind myself that this isn't the end of the world. ",
                        "I feel like everyone else looks better than me, but realize that is irrational thinking.",
                        "I post a photo from a few weeks ago where I really like how I look. ",
                        "I tell my friend it was a good idea to post a picture of everyone.",
                        "I leave a comment about how embarrassed I am. ",
                        "I want to pretend the picture doesn't exist, but decide it is fine. ",
                        "I want to ask my friends if they think I look okay, but decide I look fine on my own."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Tagged in a photo"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You've been talking to your crush on social media and they're usually quick to respond. You see that they opened your message a couple of hours ago and did not respond. "
                    ],
                    "Words": [
                        "They must have a lot to do today. ",
                        "They'll get back to me when they have time. ",
                        "They will never respond to me. ",
                        "Maybe I'm annoying them, but they also might be busy.",
                        "If they like someone else and not me, I won't like it, but I can handle it. ",
                        "I'm eager to hear back. ",
                        "I feel happy with my ability to send fun messages. ",
                        "I'm sad that they didn't message back immediately. ",
                        "I'm worried this has something to do with me, but realize this person has a lot of other things going on in their life. ",
                        "I'm sad that they didn't respond quickly, but know that I won't feel sad forever. ",
                        "I message other friends. ",
                        "I focus on other important things to do today.",
                        "I block them on the app and will never talk to them again. ",
                        "I want to remove them from my phone, but realize that would be dramatic. ",
                        "I want to send a bunch of messages to this person, but instead call my friends to hang out. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Crush not responding"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your guardian is dropping you off at your sports practice. As they drop you off, they are really loud and everyone on your team looks at you. "
                    ],
                    "Words": [
                        "I'm lucky to have a guardian that supports my hobbies. ",
                        "I think about the drills that we might do today during practice. ",
                        "My teammates will think I'm such a loser because my guardian is annoying.",
                        "I think about the drills that we might do today during practice. ",
                        "My coach hates my guardian. But then I remind myself that I can't control what my guardian does or how my coach feels. ",
                        "I'm energized to find out what we learn today at practice. ",
                        "I'm happy that the sun is shining at it seems like a great day to be outside with my teammates. ",
                        "I'm ashamed that my guardian is so loud. ",
                        "I'm scared to face my friends, but remind myself that I can tolerate these feelings. ",
                        "I'm embarrassed that my guardian seems like the only one. Then, I remember that another friend has a loud parent, and I don't judge that friend for her parent. ",
                        "I start warming up for practice. ",
                        "I smile at my friends as I get out of the car. ",
                        "I avoid making eye contact with anyone on my team. ",
                        "I feel the urge to pretend I'm sick so I don't have to face my friends, but then push myself to face my fears and go to practice. ",
                        "I want to run away, but know that my teammates are counting on me to be at practice. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Loud guardian"
                }
            ]
        },
        {
            "Name": "Home life",
            "Title": "Home life",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your guardian is dropping you off at your sports practice. As they drop you off, they are really loud and everyone on your team looks at you. "
                    ],
                    "Words": [
                        "I'm lucky to have a guardian that supports my hobbies. ",
                        "I think about the drills that we might do today during practice. ",
                        "My teammates will think I'm such a loser because my guardian is annoying.",
                        "I think about the drills that we might do today during practice. ",
                        "My coach hates my guardian. But then I remind myself that I can't control what my guardian does or how my coach feels. ",
                        "I'm energized to find out what we learn today at practice. ",
                        "I'm happy that the sun is shining at it seems like a great day to be outside with my teammates. ",
                        "I'm ashamed that my guardian is so loud. ",
                        "I'm scared to face my friends, but remind myself that I can tolerate these feelings. ",
                        "I'm embarrassed that my guardian seems like the only one. Then, I remember that another friend has a loud parent, and I don't judge that friend for her parent. ",
                        "I start warming up for practice. ",
                        "I smile at my friends as I get out of the car. ",
                        "I avoid making eye contact with anyone on my team. ",
                        "I feel the urge to pretend I'm sick so I don't have to face my friends, but then push myself to face my fears and go to practice. ",
                        "I want to run away, but know that my teammates are counting on me to be at practice. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Loud guardian"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your family members have some strong opinions and you don't always agree with them. One evening, you invite a friend over for dinner. "
                    ],
                    "Words": [
                        "I think I am smart for thinking on my own. ",
                        "My friend will be my friend no matter what my parents think. ",
                        "My parents will say something that makes my friend hate me.",
                        "Even if my parents say something that's upsetting, my friend and I can talk about it later.",
                        "If my parents say things that I don't agree with, they're still my parents and I love them. ",
                        "I'm happy to have my friend over for dinner. ",
                        "I'm calm as we sit and eat dinner together.",
                        "I'm worried that my parents will say something embarrassing.",
                        "I'm scared that my parents will say something offensive, but know that I can get through this dinner no matter what. ",
                        "I'm concerned that my friend will judge me for what my parents do at this dinner, but know that I can talk to my friend about it. ",
                        "I smile as my friend and my parents talk. ",
                        "I practice my active listening skills. ",
                        "I start thinking about all of the homework that I have to do so that I don't have to listen to what my parents say.",
                        "I want to tell my parents not to say anything embarrassing in front of my friend, but take a deep breath instead. ",
                        "I want to tell my friend that my parents might say something that I don't agree with, but remind myself that my friend will be nice to me no matter what my parents say. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Strong opinions"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are babysitting a younger kid in your neighborhood and you're watching TV while they sleep. It's dark outside and you suddenly hear noises against the window. "
                    ],
                    "Words": [
                        "There are lots of noises at night. ",
                        "It is quieter at night so it's easier to hear lots of things. ",
                        "I wonder if I'm in danger. ",
                        "My brain immediately thinks that there's a monster outside, but I remind myself that I'm probably safe. ",
                        "I picture something trying to get me, but then tell myself that it was most likely the wind on the window. ",
                        "I'm curious what I'll buy myself after I get paid for babysitting.",
                        "I'm happy that my favorite show is on TV.",
                        "I feel worried that something is looking into the window.",
                        "It makes sense that I was scared at first, but remind myself that I'm probably safe.",
                        "My heart is beating a little faster than it was before I heard the noise, but know that it'll go back to normal soon. ",
                        "I put on a funny movie. ",
                        "I decide to play some of my favorite music. ",
                        "I call my parents and start crying. ",
                        "I feel the urge to cover myself with a blanket, but tell myself that it was probably nothing outside.",
                        "I want to call the parents to have them come home soon, but tell myself that I can face my fear and that the anxiety will go away."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Babysitting"
                }
            ]
        },
        {
            "Name": "General",
            "Title": "General",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are babysitting a younger kid in your neighborhood and you're watching TV while they sleep. It's dark outside and you suddenly hear noises against the window. "
                    ],
                    "Words": [
                        "There are lots of noises at night. ",
                        "It is quieter at night so it's easier to hear lots of things. ",
                        "I wonder if I'm in danger. ",
                        "My brain immediately thinks that there's a monster outside, but I remind myself that I'm probably safe. ",
                        "I picture something trying to get me, but then tell myself that it was most likely the wind on the window. ",
                        "I'm curious what I'll buy myself after I get paid for babysitting.",
                        "I'm happy that my favorite show is on TV.",
                        "I feel worried that something is looking into the window.",
                        "It makes sense that I was scared at first, but remind myself that I'm probably safe.",
                        "My heart is beating a little faster than it was before I heard the noise, but know that it'll go back to normal soon. ",
                        "I put on a funny movie. ",
                        "I decide to play some of my favorite music. ",
                        "I call my parents and start crying. ",
                        "I feel the urge to cover myself with a blanket, but tell myself that it was probably nothing outside.",
                        "I want to call the parents to have them come home soon, but tell myself that I can face my fear and that the anxiety will go away."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Babysitting"
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your friend convinces you to go on a walk through a local park. You have heard that there are poisonous snakes in that park."
                    ],
                    "Words": [
                        "The weather is really nice. ",
                        "I like talking to this friend. ",
                        "I'm going to die if a snake bites me.",
                        "Even though it makes me uncomfortable thinking about snakes in the park, I know that I can go into the park anyway. ",
                        "I think about telling my friend that I've changed my mind, but go with them anyway. ",
                        "I'm excited to catch up with my friend. ",
                        "I'm eager to tell my friend about what happened at school today. ",
                        "I'm so worried about whether I see a snake.",
                        "I'm scared to go into the park, but then realize I've never heard of someone getting bitten in that park. ",
                        "I'm anxious thinking about a snake biting me, but know that I'll be OK on this walk.",
                        "I put on my shoes and head out the door. ",
                        "I meet my friend at the park entrance. ",
                        "I tell my friend that I'm not feeling well and that I can't go.",
                        "I want to avoid going to the park, but challenge myself to go. ",
                        "I consider bailing on my friend, but push myself to go on the walk anyway. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Snakes in the park"
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session5_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're working on your math homework with a few friends and get stuck on a problem. Your friend suggests that you find the answer online, but that's considered cheating on the assignment. "
                    ],
                    "Words": [
                        "I can get great answers all on my own.",
                        "I think that this will be better if i don't cheat and actually learn the material. ",
                        "I'll get a bad grade if I don't cheat. ",
                        "I feel like I may not get the best grade on the assignment, but at least I didn't cheat.",
                        "I feel like my teacher will not be okay with me getting wrong answers, but it is a part of learning. ",
                        "I'll feel so proud that I did the homework on my own if I don't cheat",
                        "I'll be pretty confident knowing I can do hard homework problems next time. ",
                        "I am upset at my friends wanting me to take the easy way out. ",
                        "I'm nervous about attempting to do this problem on my own, but give it a try anyway.",
                        "I feel embarrassed about not wanting to cheat, but know my friends will look up to me if I don't. ",
                        "I give suggest doing the problem without cheating. ",
                        "I am enthusiastic about trying new ways to figure out the answer. ",
                        "I cheat off of my friend's homework.",
                        "I want to cheat so that this assignment is done, but keep trying anyway. ",
                        "I am tempted to ask them what it said online, but decide not to. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    },
                    "Caption": "Friends cheating"
                }
            ]
        }
    ],
    "AfterDomain": [
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "On the next screen, you'll see a situation that might make someone nervous, worried, scared, or anxious. Here's an example: You're out with friends and receive this message from your parent saying, \"You need to come home right now.\""
            ],
            "Type": "Single",
            "Number": 100
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "In the text box, please write as many different thoughts that might come to your mind in that moment. You'll have 60 seconds to do this. For this example, you might write: What did I do wrong? My parent has something really important to tell me. I'm really tired, so I'm glad to be going home."
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": "60"
                }
            },
            "Number": 101
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "As you're eating breakfast, your parents say there are going to be some changes coming up."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/quickthinking/pic5.jpeg",
            "ImageType": "image/jpeg",
            "ImageEmbedded": "true",
            "ImageFromUrl": "true",
            "Number": 102
        }
    ]
}