{
    "Name": "FAQ",
    "Title": "FAQ",
    "Sections": [
        {
            "Name": "FAQ",
            "PageGroups": [
                {
                    "Name": "FAQ",
                    "Title": "FAQ",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p><strong>Q: What activities am I supposed to be doing and when?</strong></p><p><strong>A:</strong> If you were assigned to try the Hoos Think Calmly mobile application, ideally you would complete two Microdoses (a.k.a \"sessions\") at any time and one Nightly Survey at the end of the day, for a total of 3 tasks every day. Additionally, you would complete the Track Your Progress Survey when it becomes available once every two weeks for eight weeks.</p><p>If you were assigned to continue managing your stress as usual, ideally you would complete the Track Your Progress Survey when it becomes available once every two weeks for eight weeks.</p><p><strong>Q: Why are some of the exercises repetitive?</strong></p><p><strong>A:</strong> The app is designed to develop the habit of flexible thinking through repeated training. We believe repetition is necessary for building new thinking skills. Changing our thinking habits takes time, so be patient and stick with it! Watch <a href=\"https://www.youtube.com/watch?v=mktHMDGfzu8\">\"Why MindTrails Involves Repetition\"</a> by team member Alexandra Silverman to learn more.</p><p><strong>Q: Why do some scenarios have a negative ending?</strong></p><p><strong>A:</strong> The purpose of MindTrails is to encourage flexibility between positive, negative, and neutral thoughts. As you practice, you will learn that there are many different ways a situation can be interpreted, and the worst-case scenario is only one of them. Watch <a href=\"https://www.youtube.com/watch?v=SNrXoTFFeok\">\"Why MindTrails Doesn't Have All Stories End Positively\"</a> by team member Jeremy Eberle to learn more.</p><p><strong>Q: What do I do if I'm not receiving app notifications?</strong></p><p><strong>A:</strong> There are a few suggestions! Make sure your notifications are enabled. To do this, go to the settings app on your phone and click on MindTrails. Then select to allow for notifications.</p><p>We have also found that notifications are most reliable when the MindTrails app is running in the background of your phone at all times. If you tend to swipe out of your apps, we recommend that you avoid doing that for MindTrails.</p><p>If you need to contact us for more assistance, please be sure to address the following questions:</p><p style=\"margin: 0px;\">What device are you using (e.g., iPhone, Android phone)?</p><p style=\"margin: 0px;\">What operating system version are you using (e.g., iOS 16.3.1)?</p><p style=\"margin: 0px;\">What app version do you have (e.g.,1.5.0)?</p><p>If you prefer to have email reminders scheduled for you instead, we'd be more than happy to accommodate that as well.</p><p><strong>Q: What is CBM-I?</strong></p><p><strong>A:</strong> CBM-I stands for cognitive bias modification of interpretations. This is a strategy commonly used to try and modify the cognitive biases that are often present in individuals that struggle with anxiety. These biases may manifest when individuals automatically interpret certain ambiguous stimuli in a negative way. CBM-I provides repeated practice thinking in new ways to attempt to alter automatic negative thought processes and promote flexible thinking patterns.</p><p><strong>Q: How can I get more help for my stress and anxiety?</strong></p><p><strong>A:</strong> The Hoos Think Calmly Team has put together a <a href=\"https://ert6g2.wixsite.com/hoosthinkcalmly/general-8\">list of resources</a> on our website with more information on anxiety and mental health treatment, as well as self-guided resources and referrals for treatment with a professional. Additionally, if you were assigned to continue managing your stress as usual at the beginning of the study and you would like to try Hoos Think Calmly after completing the study, send us an email at <a href=\"mailto:hoosthinkcalmly@gmail.com\">hoosthinkcalmly@gmail.com</a>.</p><p><strong>Q: Who should I contact if I'm having technical difficulties?</strong></p><p><strong>A:</strong> You can contact <a href=\"mailto:hoosthinkcalmly@gmail.com\">hoosthinkcalmly@gmail.com</a> if you are experiencing any technical issues. For best assistance, please include the following information in your email:</p><p style=\"margin: 0px;\">What device are you using (e.g., iPhone, Android phone)?</p><p style=\"margin: 0px;\">What operating system version are you using (e.g., iOS 16.3.1)?</p><p style=\"margin: 0px;\">What app version do you have (e.g.,1.5.0)?</p><p><strong>Q: How can I make sure I get the training condition expected to be most effective?</strong></p><p><strong>A:</strong> Everyone will be randomly assigned to one of the conditions being tested - you are not able to choose which group you are assigned to. This is necessary so the researchers can scientifically test how well each condition works. If you were assigned to continue managing your stress as usual at the beginning of the study and you would like to try Hoos Think Calmly after completing the study, send us an email at <a href=\"mailto:hoosthinkcalmly@gmail.com\">hoosthinkcalmly@gmail.com</a>.</p><p><strong>Q: When answering questions (following each of the brief stories), the program keeps telling me that my answer is incorrect.</strong></p><p><strong>A:</strong> Please answer the questions based on information given to you in the stories. Remember that it is essential that you fully involve yourself as if the events described are really happening to you, so your answers should reflect that.</p><p><strong>Q: When trying to complete word fragments at the end of the brief stories, the program keeps telling me my answer is incorrect.</strong></p><p><strong>A:</strong> Please complete the word fragments based only on information given to you in the brief stories.</p><p><strong>Q: When the app is open, is it draining my phone battery?</strong></p><p><strong>A:</strong> The app has minimal impact on battery use because it does not collect data when it is not being actively used.</p><p><strong>Q: How is my data being protected?</strong></p><p><strong>A:</strong> Data collected by MindTrails is encrypted and does not contain any identifying information. Data is stored locally on your phone for a temporary period of time, then synced and securely stored on Amazon Cloud both immediately after a training session is completed (if WiFi or cellular data is available) and periodically (i.e., 1-2 times) throughout the day. After data collection has concluded, the data is transferred from Amazon Cloud to an encrypted hard drive. At each stage, access to the data is strictly limited to the research personnel associated with the project.</p>"
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
