{
    "Name": "WhatIsAnxiety",
    "Title": "What is Anxiety?",
    "Sections": [
        {
            "Name": "WhatIsAnxiety",
            "PageGroups": [
                {
                    "Name": "WhatIsAnxiety",
                    "Title": "What is Anxiety?",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Media",
                                    "Frame": false,
                                    "Parameters": {
                                        "ImageUrl": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/HTC/protocols/protocol1/media/videos/video4.mp4",
                                        "ImageType": "video/mp4"
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p>Anxiety is one of the most basic human emotions, and it is a normal and common experience. At one time or another, all of us are likely to feel stressed out; worried about school or work health, or family; we might be scared in potentially dangerous situations (e.g., driving during inclement weather or before getting a root canal); or we might be concerned about what other people think. Anxious feelings usually come with a variety of changes in one’s thoughts, bodily reactions, and behavior.</p><br><p><strong>When Is Anxiety Helpful?</strong></p><br><p>Anxiety can be a useful emotion! It has helped humans survive dangerous situations for thousands of years. For example, if you were being chased by a tiger, you would be most likely to survive by responding with fear and fleeing and avoiding the tiger. The fear would increase your ability to detect danger and would prepare your body for fight or flight. Anxiety helps people manage threats to the health and well-being of themselves or others. A reasonable level of anxiety increases attention, concentration, and performance.</p><br><p>Of course, today it is unlikely that we will be regularly confronted by tigers, but there are other situations in which fear is still reasonable.</p><br><p>Next week, Malik has an important job application due. When he thinks about the application, his heart beats faster than normal and he feels a little stressed. These feelings motivate him to prepare his application so that he will get the job. While the situation is not dangerous, some anxiety can still be useful as it helps him to prepare.</p><br><p><strong>So when Is Anxiety a Problem?</strong></p><br><p>Although anxiety can be helpful in dangerous situations, it can also be harmful when there is no real threat. Too much anxiety can get in the way of people’s day-to-day life and might be doing more harm than good. It might become difficult to control what triggers anxiety and how long it lasts, even if a person knows there is no real danger. These are signs of harmful anxiety. Changing the anxious thinking patterns so you don’t exaggerate the risk of danger and trying not to avoid situations just because they make you anxious can help make sure anxiety is more helpful than harmful.</p>"
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}