{
    "Name": "WaysToUseTheProgram",
    "Title": "Ways to Use the Program",
    "Sections": [
        {
            "Name": "WaysToUseTheProgram",
            "PageGroups": [
                {
                    "Name": "WaysToUseTheProgram",
                    "Title": "Ways to Use the Program",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Media",
                                    "Frame": false,
                                    "Parameters": {
                                        "ImageUrl": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/blob/main/HTC/protocols/MTM/media/videos/video2.mp4",
                                        "ImageType": "video/mp4"
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p>There is no, one right way to use MindTrails-Movement. Whether you’ve been diagnosed with an anxiety disorder in addition to a movement disorder, or you just want help managing your stress. MindTrails-Movement is meant to be a helpful tool that’s available whenever you need it.</p><br><p>MindTrails-Movement can be used alongside other treatments–such as therapy or medication–as a program to both practice skills that you’ve already learned and add additional tools to your toolbox. If you have not had experience with mental health treatment in the past, MindTrails is a great place to start! The skills taught in MindTrails-Movement overlap with skills taught in other evidence-based treatments for anxiety. MindTrails-Movement can be an important step in managing anxiety using your smartphone or tablet.</p><br><p>If you’ve had experience with mental health treatment in the past, MindTrails-Movement can help you maintain what you gained from treatment and continue to practice skills to keep your anxiety at bay. Regardless, MindTrails emphasizes flexible thinking in your everyday life through short 5-10 minute sessions.</p><br><p>This is one way of managing anxiety and stress, and there are many other tools out there to help you as well! If you are interested in additional tools for managing several aspects of your diagnosis, like stress and anxiety, please visit the Resources tab on the main page of the app.</p><br><p>In whatever way you plan to use the app, we hope that you’re able to gain new strategies and resources to help you in your day-to-day life.</p>"
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}