{
    "Name": "ProgramRationale",
    "Title": "Program Rationale",
    "Sections": [
        {
            "Name": "ProgramRationale",
            "PageGroups": [
                {
                    "Name": "ProgramRationale",
                    "Title": "Program Rationale",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Media",
                                    "Frame": false,
                                    "Parameters": {
                                        "ImageUrl": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/blob/main/HTC/protocols/MTM/media/videos/video1.mp4",
                                        "ImageType": "video/mp4"
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p>Imagine you are ordering a coffee and there is a long line behind you. When you reach the counter, you have trouble grabbing your money as your hands begin to move uncontrollably. You jump to the worst-case scenario, thinking: All of the people behind me are going to stare at me. What if they think I’m weird?</p><br><p>Why do you have those thoughts?</p><br><p>People with anxiety have rigid, negative thinking patterns that can make them interpret uncertain situations as threatening. People with movement disorders, such as Huntington’s and Parkinson’s disease, are at a heightened risk for developing anxiety and depression, which means these negative thinking patterns can be even more common. Dealing with anxiety on top of your disease can be extremely stressful.</p><br><p>This is where MindTrails comes in! MindTrails-Movement is a program that can help you deal with high levels of stress and anxiety by developing your flexible thinking skills.</p><br><p>Throughout the program, you will be exposed to ambiguous situations, like the coffee shop example, and practice responding to them in different ways.</p><br><p>The situations will have a mix of positive, neutral, and negative endings. As you practice, you will see that there are many different ways a situation can be interpreted, and the worst-case scenario is only one of them.</p><br><p>It is important that you vividly imagine yourself in the story being described, so you can practice thinking flexibly in a variety of situations to apply to your own life. Movement disorders can cause a great deal of stress, so learning to use these flexible thinking skills in your daily life can ease the burden that anxiety causes.</p><br><p>You may feel as though the program is repetitive. That’s to be expected because you need to repeatedly practice the new thinking skills. Changing our thinking habits takes time, so be patient and stick with it! Research shows that programs like MindTrails-Movement can be effective in changing rigid negative thinking and reducing anxiety.</p> <br><p>As you begin MindTrails-Movement, we encourage you to think about what you hope to gain from the program. There are no wrong answers. How could your life be better if you reduced your anxious thinking? We hope MindTrails can help you meet your goals!</p>"
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}