{
    "Name": "Track Your Progress",
    "Title": "Track Your Progress",
    "TimeToComplete": "00:5:00",
    "DoseMethod": "OnRun",
    "DoseBySection": true,
    "Sections": [
        {
            "Name": "Track Your Progress - Week 2",
            "PageGroups": [
                {
                    "Name": "Anxiety Scale",
                    "Title": "Anxiety Scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often have you felt anxious?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_days_anxious",
                                    "Parameters": {
                                        "Buttons": [
                                            "No anxiety in the past week",
                                            "Infrequent anxiety. Felt anxious a few times.",
                                            "Occasional anxiety. Felt anxious as much of the time as not. It was hard to relax.",
                                            "Frequent anxiety. Felt anxius most of the time. It was very difficult to relax.",
                                            "Constant anxiety. Felt anxious all of the time and never really relaxed.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, when you have felt anxious, how intense or severe was your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_intensity_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Little or None: Anxiety was absent or barely noticeable.",
                                            "Mild: Anxiety was at a low level. It was possible to relax when I tried. Physical symptoms were only slightly uncomfortable.",
                                            "Moderate: Anxiety was distressing at times. It was hard to relax or concentrate, but I could do it if I tried. Physical symptoms were uncomfortable.",
                                            "Severe: Anxiety was intense much of the time. It was very difficult to relax or focus on anything else. Physical symptoms were uncomfortable.",
                                            "Extreme: Anxiety was overwhelming. It was impossible to relax at all. Physical symptoms were unbearable.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often did you avoid situations, places, objects, or activities because of anxiety or fear?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_avoid",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: I do not avoid places, situations, activities, or things because of fear.",
                                            "Infrequent: I avoid something once in a while, but will usually face the situation or confront the object. My lifestyle is not affected.",
                                            "Occasional: I have some fear of certain situations, places, or objects, but it is still manageable. My lifestyle has only changed in minor ways. I always or almost always avoid the things I fear when I'm alone, but can handle them if someone comes with me.",
                                            "Frequent: I have considerable fear and really try to avoid the things that frighten me. I have made significant changes in my lifestyle to avoid the object, situation, activity, or place.",
                                            "All the time: Avoiding objects, situations, or places has taken over my life. My lifestyle has been extensively affected and I no longer do the things that I used to enjoy.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your ability to do the things you needed to do at work, at school, or at home?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_work",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: No interference at work/home/school from anxiety",
                                            "Mild: My anxiety has caused some interference at work/home/school. Things are more difficult, but everything that needs to be done is still getting done.",
                                            "Moderate: My anxiety definitely interferes with tasks. Most things are still getting done, but few things are being done as  well as in the past.",
                                            "Severe: My anxiety has really changed by ability to get things done. Some tasks are still being done, but many things are  not. My performance has definitely suffered.",
                                            "Extreme: My anxiety has become incapacitating. I am unable to complete tasks and have had to leave school, have quit or  been fired from my job, or have been unable to complete tasks at home and have faced consequences like bill collectors,  eviction, etc.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your social life and relationships?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_social",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: My anxiety doesn't affect my relationships.",
                                            "Mild: My anxiety slightly interferes with my relationships. Some of my friendships and other relationships have suffered, but, overall, my social life is still fulfilling.",
                                            "Moderate: I have experienced some interference with my social life, but I still have a few close relationships. I don't spend as much time with others as in the past, but I still socialize sometimes.",
                                            "Severe: My friendships and other relationships have suffered a lot because of anxiety. I do not enjoy social activities. I socialize very little.",
                                            "Extreme: My anxiety has completely disrupted my social activities. All of my relationships have suffered or ended. My family life is extremely strained.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Sadness scale",
                    "Title": "Sadness scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nLittle interest or pleasure in doing things."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nFeeling down, depressed, or hopeless."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_depressed",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Stress scale",
                    "Title": "Stress scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that you were unable to control the important things in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_control",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt confident about your ability to handle your personal problems?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_personal",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that things were going your way?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_way",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt difficulties were piling up so high that you could not overcome them?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_difficulties",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Interpretation Bias Measures",
                    "Title": "Interpretation Bias Measures",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In this brief exercise, you will read several short stories.\n\nPlease read each one carefully and try to imagine yourself in the situation.\n\nThe last word of each story is incomplete. Click on the missing letter to complete the word.\n\nAfter you correctly complete the word, you will be asked a question about the story. Answer the question based on the information in the story."
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are in the lobby of your friend's new apartment building.  You press the button to the elevator to go up. The building looks old. As you get on the elevator you think about its..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Elevator",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "safety"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you think about the elevator's safety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_elevator",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Your friend asks you to give a speech at her wedding reception. You prepare some remarks and when the time comes, get to your feet. As you speak, you notice some people in the audience start to..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Wedding Reception",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "laugh"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Does the audience laugh when you speak?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_wedding",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are currently working as a contractor for a company. Once this job is finished, you will be without employment until you can find your next job. You think about not having an income for a few weeks and about your future..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Job",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "finances"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Will you be without an income soon?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_job",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are woken up in the middle of the night by a loud noise. You are not sure what caused the noise and leave your bedroom to see what happened. You walk..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Loud Noise",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "downstairs"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Have you been woken up in the middle of the night?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_noise",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the street you bump into an old friend you haven't seen for a long time. She is too busy to stop, so you arrange to meet later in a bar. You arrive a little late but the bar is empty and a few minutes later she is still not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresMeeting a Friend",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "there"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did your friend stop?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_friend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are eating lunch with a friend. As you start eating your salad, you describe your plans for the weekend. You accidentally drop a piece of lettuce, and your friend looks at..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Lunch",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "you"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have salad for lunch?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_lunch",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are playing basketball with some friends. While running toward the ball, you trip and scrape your knee. The scrape hurts a bit, but does not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Scrape",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "bleed"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you playing soccer with your friend?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_scrape",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at the mall with your friend. While you shop, she tells you how several of her friends have recently come down with a strange illness. You think about your recent health, and wonder if you will get..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Shopping Trip",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "sick"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you shopping alone?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_shopping",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at a routine doctor's appointment. At the appointment, the doctor decides to run a few blood tests to check your health. The doctor says he will call you in a few weeks, and you will find out your test results at that..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Blood Test",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "time"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you take blood tests?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_blood",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Track Your Progress",
                    "Title": "Track Your Progress",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How helpful do you find Hoos Think Calmly for reducing your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "reduce_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much does Hoos Think Calmly keep your interest and attention? "
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "keep_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much could you relate to the stories presented during training sessions?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "relate_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How believable did you find the stories' endings in terms of those outcomes happening in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "believable_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much do you like the way Hoos Think Calmly looks?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "UI",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How easy is Hoos Think Calmly to use?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "easy_to_use",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "I find the training sessions to be:"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "find_sessions",
                                    "Parameters": {
                                        "Buttons": [
                                            "Way too short",
                                            "Somewhat too short",
                                            "The right length",
                                            "Somewhat too long",
                                            "Way too long",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How useful do you find the nightly survey that enables you to choose when to complete training the next day?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "nightly_survey_use",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "Name": "Track Your Progress - Week 4",
            "PageGroups": [
                {
                    "Name": "Anxiety Scale",
                    "Title": "Anxiety Scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often have you felt anxious?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_days_anxious",
                                    "Parameters": {
                                        "Buttons": [
                                            "No anxiety in the past week",
                                            "Infrequent anxiety. Felt anxious a few times.",
                                            "Occasional anxiety. Felt anxious as much of the time as not. It was hard to relax.",
                                            "Frequent anxiety. Felt anxius most of the time. It was very difficult to relax.",
                                            "Constant anxiety. Felt anxious all of the time and never really relaxed.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, when you have felt anxious, how intense or severe was your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_intensity_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Little or None: Anxiety was absent or barely noticeable.",
                                            "Mild: Anxiety was at a low level. It was possible to relax when I tried. Physical symptoms were only slightly uncomfortable.",
                                            "Moderate: Anxiety was distressing at times. It was hard to relax or concentrate, but I could do it if I tried. Physical symptoms were uncomfortable.",
                                            "Severe: Anxiety was intense much of the time. It was very difficult to relax or focus on anything else. Physical symptoms were uncomfortable.",
                                            "Extreme: Anxiety was overwhelming. It was impossible to relax at all. Physical symptoms were unbearable.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often did you avoid situations, places, objects, or activities because of anxiety or fear?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_avoid",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: I do not avoid places, situations, activities, or things because of fear.",
                                            "Infrequent: I avoid something once in a while, but will usually face the situation or confront the object. My lifestyle is not affected.",
                                            "Occasional: I have some fear of certain situations, places, or objects, but it is still manageable. My lifestyle has only changed in minor ways. I always or almost always avoid the things I fear when I'm alone, but can handle them if someone comes with me.",
                                            "Frequent: I have considerable fear and really try to avoid the things that frighten me. I have made significant changes in my lifestyle to avoid the object, situation, activity, or place.",
                                            "All the time: Avoiding objects, situations, or places has taken over my life. My lifestyle has been extensively affected and I no longer do the things that I used to enjoy.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your ability to do the things you needed to do at work, at school, or at home?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_work",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: No interference at work/home/school from anxiety",
                                            "Mild: My anxiety has caused some interference at work/home/school. Things are more difficult, but everything that needs to be done is still getting done.",
                                            "Moderate: My anxiety definitely interferes with tasks. Most things are still getting done, but few things are being done as  well as in the past.",
                                            "Severe: My anxiety has really changed by ability to get things done. Some tasks are still being done, but many things are  not. My performance has definitely suffered.",
                                            "Extreme: My anxiety has become incapacitating. I am unable to complete tasks and have had to leave school, have quit or  been fired from my job, or have been unable to complete tasks at home and have faced consequences like bill collectors,  eviction, etc.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your social life and relationships?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_social",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: My anxiety doesn't affect my relationships.",
                                            "Mild: My anxiety slightly interferes with my relationships. Some of my friendships and other relationships have suffered, but, overall, my social life is still fulfilling.",
                                            "Moderate: I have experienced some interference with my social life, but I still have a few close relationships. I don't spend as much time with others as in the past, but I still socialize sometimes.",
                                            "Severe: My friendships and other relationships have suffered a lot because of anxiety. I do not enjoy social activities. I socialize very little.",
                                            "Extreme: My anxiety has completely disrupted my social activities. All of my relationships have suffered or ended. My family life is extremely strained.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Sadness scale",
                    "Title": "Sadness scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nLittle interest or pleasure in doing things."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nFeeling down, depressed, or hopeless."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_depressed",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Stress scale",
                    "Title": "Stress scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that you were unable to control the important things in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_control",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt confident about your ability to handle your personal problems?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_personal",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that things were going your way?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_way",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt difficulties were piling up so high that you could not overcome them?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_difficulties",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Interpretation Bias Measures",
                    "Title": "Interpretation Bias Measures",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In this brief exercise, you will read several short stories.\n\nPlease read each one carefully and try to imagine yourself in the situation.\n\nThe last word of each story is incomplete. Click on the missing letter to complete the word.\n\nAfter you correctly complete the word, you will be asked a question about the story. Answer the question based on the information in the story."
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are in the lobby of your friend's new apartment building.  You press the button to the elevator to go up. The building looks old. As you get on the elevator you think about its..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Elevator",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "safety"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you think about the elevator's safety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_elevator",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Your friend asks you to give a speech at her wedding reception. You prepare some remarks and when the time comes, get to your feet. As you speak, you notice some people in the audience start to..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Wedding Reception",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "laugh"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Does the audience laugh when you speak?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_wedding",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are currently working as a contractor for a company. Once this job is finished, you will be without employment until you can find your next job. You think about not having an income for a few weeks and about your future..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Job",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "finances"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Will you be without an income soon?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_job",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are woken up in the middle of the night by a loud noise. You are not sure what caused the noise and leave your bedroom to see what happened. You walk..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Loud Noise",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "downstairs"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Have you been woken up in the middle of the night?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_noise",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the street you bump into an old friend you haven't seen for a long time. She is too busy to stop, so you arrange to meet later in a bar. You arrive a little late but the bar is empty and a few minutes later she is still not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresMeeting a Friend",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "there"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did your friend stop?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_friend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are eating lunch with a friend. As you start eating your salad, you describe your plans for the weekend. You accidentally drop a piece of lettuce, and your friend looks at..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Lunch",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "you"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have salad for lunch?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_lunch",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are playing basketball with some friends. While running toward the ball, you trip and scrape your knee. The scrape hurts a bit, but does not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Scrape",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "bleed"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you playing soccer with your friend?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_scrape",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at the mall with your friend. While you shop, she tells you how several of her friends have recently come down with a strange illness. You think about your recent health, and wonder if you will get..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Shopping Trip",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "sick"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you shopping alone?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_shopping",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at a routine doctor's appointment. At the appointment, the doctor decides to run a few blood tests to check your health. The doctor says he will call you in a few weeks, and you will find out your test results at that..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Blood Test",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "time"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you take blood tests?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_blood",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Track Your Progress",
                    "Title": "Track Your Progress",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How helpful do you find Hoos Think Calmly for reducing your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "reduce_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much does Hoos Think Calmly keep your interest and attention?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "keep_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much could you relate to the stories presented during training sessions?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "relate_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How believable did you find the stories' endings in terms of those outcomes happening in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "believable_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How worried are you about your privacy in using Hoos Think Calmly?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "privacy",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How tiring do you find the training sessions?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "tiring_training",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How tiring do you find the assessments?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "tiring_assessments",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much do you like the \"favorites\" feature of the app?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "favorites",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How useful do you find the strategies and tips provided by the app?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "tips_use",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "Name": "Track Your Progress - Week 6",
            "PageGroups": [
                {
                    "Name": "Anxiety Scale",
                    "Title": "Anxiety Scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often have you felt anxious?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_days_anxious",
                                    "Parameters": {
                                        "Buttons": [
                                            "No anxiety in the past week",
                                            "Infrequent anxiety. Felt anxious a few times.",
                                            "Occasional anxiety. Felt anxious as much of the time as not. It was hard to relax.",
                                            "Frequent anxiety. Felt anxius most of the time. It was very difficult to relax.",
                                            "Constant anxiety. Felt anxious all of the time and never really relaxed.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, when you have felt anxious, how intense or severe was your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_intensity_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Little or None: Anxiety was absent or barely noticeable.",
                                            "Mild: Anxiety was at a low level. It was possible to relax when I tried. Physical symptoms were only slightly uncomfortable.",
                                            "Moderate: Anxiety was distressing at times. It was hard to relax or concentrate, but I could do it if I tried. Physical symptoms were uncomfortable.",
                                            "Severe: Anxiety was intense much of the time. It was very difficult to relax or focus on anything else. Physical symptoms were uncomfortable.",
                                            "Extreme: Anxiety was overwhelming. It was impossible to relax at all. Physical symptoms were unbearable.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often did you avoid situations, places, objects, or activities because of anxiety or fear?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_avoid",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: I do not avoid places, situations, activities, or things because of fear.",
                                            "Infrequent: I avoid something once in a while, but will usually face the situation or confront the object. My lifestyle is not affected.",
                                            "Occasional: I have some fear of certain situations, places, or objects, but it is still manageable. My lifestyle has only changed in minor ways. I always or almost always avoid the things I fear when I'm alone, but can handle them if someone comes with me.",
                                            "Frequent: I have considerable fear and really try to avoid the things that frighten me. I have made significant changes in my lifestyle to avoid the object, situation, activity, or place.",
                                            "All the time: Avoiding objects, situations, or places has taken over my life. My lifestyle has been extensively affected and I no longer do the things that I used to enjoy.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your ability to do the things you needed to do at work, at school, or at home?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_work",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: No interference at work/home/school from anxiety",
                                            "Mild: My anxiety has caused some interference at work/home/school. Things are more difficult, but everything that needs to be done is still getting done.",
                                            "Moderate: My anxiety definitely interferes with tasks. Most things are still getting done, but few things are being done as  well as in the past.",
                                            "Severe: My anxiety has really changed by ability to get things done. Some tasks are still being done, but many things are  not. My performance has definitely suffered.",
                                            "Extreme: My anxiety has become incapacitating. I am unable to complete tasks and have had to leave school, have quit or  been fired from my job, or have been unable to complete tasks at home and have faced consequences like bill collectors,  eviction, etc.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your social life and relationships?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_social",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: My anxiety doesn't affect my relationships.",
                                            "Mild: My anxiety slightly interferes with my relationships. Some of my friendships and other relationships have suffered, but, overall, my social life is still fulfilling.",
                                            "Moderate: I have experienced some interference with my social life, but I still have a few close relationships. I don't spend as much time with others as in the past, but I still socialize sometimes.",
                                            "Severe: My friendships and other relationships have suffered a lot because of anxiety. I do not enjoy social activities. I socialize very little.",
                                            "Extreme: My anxiety has completely disrupted my social activities. All of my relationships have suffered or ended. My family life is extremely strained.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Sadness scale",
                    "Title": "Sadness scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nLittle interest or pleasure in doing things."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nFeeling down, depressed, or hopeless."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_depressed",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Stress scale",
                    "Title": "Stress scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that you were unable to control the important things in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_control",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt confident about your ability to handle your personal problems?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_personal",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that things were going your way?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_way",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt difficulties were piling up so high that you could not overcome them?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_difficulties",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Interpretation Bias Measures",
                    "Title": "Interpretation Bias Measures",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In this brief exercise, you will read several short stories.\n\nPlease read each one carefully and try to imagine yourself in the situation.\n\nThe last word of each story is incomplete. Click on the missing letter to complete the word.\n\nAfter you correctly complete the word, you will be asked a question about the story. Answer the question based on the information in the story."
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are in the lobby of your friend's new apartment building.  You press the button to the elevator to go up. The building looks old. As you get on the elevator you think about its..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Elevator",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "safety"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you think about the elevator's safety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_elevator",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Your friend asks you to give a speech at her wedding reception. You prepare some remarks and when the time comes, get to your feet. As you speak, you notice some people in the audience start to..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Wedding Reception",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "laugh"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Does the audience laugh when you speak?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_wedding",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are currently working as a contractor for a company. Once this job is finished, you will be without employment until you can find your next job. You think about not having an income for a few weeks and about your future..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Job",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "finances"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Will you be without an income soon?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_job",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are woken up in the middle of the night by a loud noise. You are not sure what caused the noise and leave your bedroom to see what happened. You walk..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Loud Noise",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "downstairs"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Have you been woken up in the middle of the night?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_noise",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the street you bump into an old friend you haven't seen for a long time. She is too busy to stop, so you arrange to meet later in a bar. You arrive a little late but the bar is empty and a few minutes later she is still not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresMeeting a Friend",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "there"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did your friend stop?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_friend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are eating lunch with a friend. As you start eating your salad, you describe your plans for the weekend. You accidentally drop a piece of lettuce, and your friend looks at..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Lunch",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "you"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have salad for lunch?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_lunch",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are playing basketball with some friends. While running toward the ball, you trip and scrape your knee. The scrape hurts a bit, but does not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Scrape",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "bleed"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you playing soccer with your friend?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_scrape",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at the mall with your friend. While you shop, she tells you how several of her friends have recently come down with a strange illness. You think about your recent health, and wonder if you will get..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Shopping Trip",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "sick"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you shopping alone?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_shopping",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at a routine doctor's appointment. At the appointment, the doctor decides to run a few blood tests to check your health. The doctor says he will call you in a few weeks, and you will find out your test results at that..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Blood Test",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "time"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you take blood tests?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_blood",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Track Your Progress",
                    "Title": "Track Your Progress",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How helpful did you find Hoos Think Calmly for reducing your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "reduce_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much did Hoos Think Calmly keep your interest and attention?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "keep_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How much could you relate to the stories presented during training sessions?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "relate_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How believable did you find the stories' endings in terms of those outcomes happening in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "believable_scenarios",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How likely would you be to recommend Hoos Think Calmly to others with similar anxiety difficulties?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "recommend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have moderate-to-severe anxiety or depression symptoms?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "anxiety_or_depression",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes::Yes",
                                            "No::No",
                                            "Unsure::Unsure"
                                        ],
                                        "Selectable": true
                                    },
                                    "VariableName": "AnxietyDepressionSymptoms"
                                }
                            ]
                        },
                        {
                            "Conditions": [
                                {
                                    "VariableName": "AnxietyDepressionSymptoms",
                                    "Value": "Yes"
                                }
                            ],
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How open or interested are you in pursuing other forms of treatment from a mental health professional (e.g., therapy, medication) compared to before you started the program?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "interest_in_therapy",
                                    "Parameters": {
                                        "Buttons": [
                                            "Much more likely",
                                            "A little more likely",
                                            "Equally likely",
                                            "A little less likely",
                                            "Much less likely",
                                            "Not applicable (e.g., I'm currently undergoing another form of treatment)",
                                            "Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Conditions": [
                                {
                                    "VariableName": "AnxietyDepressionSymptoms",
                                    "Value": "Unsure"
                                }
                            ],
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How open or interested are you in pursuing other forms of treatment from a mental health professional (e.g., therapy, medication) compared to before you started the program?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "interest_in_therapy",
                                    "Parameters": {
                                        "Buttons": [
                                            "Much more likely",
                                            "A little more likely",
                                            "Equally likely",
                                            "A little less likely",
                                            "Much less likely",
                                            "Not applicable (e.g., I'm currently undergoing another form of treatment)",
                                            "Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How useful did you find the resources and referrals provided in the app?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "resources_use",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Would you like to provide feedback about your experience using Hoos Think Calmly (e.g., ways the program has been helpful or ways we can improve the program)?"
                                    }
                                },
                                {
                                    "Type": "Entry",
                                    "Name": "feedback"
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do we have your permission to use all or part of the feedback you provided as a de-identified participant testimonial (e.g., as part of the Hoos Think Calmly program, or in newsletters or other promotional materials)? If so, neither your name nor any other identifying information would be used. "
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "permission",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "Name": "Track Your Progress - Week 8",
            "PageGroups": [
                {
                    "Name": "Anxiety Scale",
                    "Title": "Anxiety Scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often have you felt anxious?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_days_anxious",
                                    "Parameters": {
                                        "Buttons": [
                                            "No anxiety in the past week",
                                            "Infrequent anxiety. Felt anxious a few times.",
                                            "Occasional anxiety. Felt anxious as much of the time as not. It was hard to relax.",
                                            "Frequent anxiety. Felt anxius most of the time. It was very difficult to relax.",
                                            "Constant anxiety. Felt anxious all of the time and never really relaxed.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, when you have felt anxious, how intense or severe was your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_intensity_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Little or None: Anxiety was absent or barely noticeable.",
                                            "Mild: Anxiety was at a low level. It was possible to relax when I tried. Physical symptoms were only slightly uncomfortable.",
                                            "Moderate: Anxiety was distressing at times. It was hard to relax or concentrate, but I could do it if I tried. Physical symptoms were uncomfortable.",
                                            "Severe: Anxiety was intense much of the time. It was very difficult to relax or focus on anything else. Physical symptoms were uncomfortable.",
                                            "Extreme: Anxiety was overwhelming. It was impossible to relax at all. Physical symptoms were unbearable.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how often did you avoid situations, places, objects, or activities because of anxiety or fear?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_avoid",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: I do not avoid places, situations, activities, or things because of fear.",
                                            "Infrequent: I avoid something once in a while, but will usually face the situation or confront the object. My lifestyle is not affected.",
                                            "Occasional: I have some fear of certain situations, places, or objects, but it is still manageable. My lifestyle has only changed in minor ways. I always or almost always avoid the things I fear when I'm alone, but can handle them if someone comes with me.",
                                            "Frequent: I have considerable fear and really try to avoid the things that frighten me. I have made significant changes in my lifestyle to avoid the object, situation, activity, or place.",
                                            "All the time: Avoiding objects, situations, or places has taken over my life. My lifestyle has been extensively affected and I no longer do the things that I used to enjoy.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your ability to do the things you needed to do at work, at school, or at home?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_work",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: No interference at work/home/school from anxiety",
                                            "Mild: My anxiety has caused some interference at work/home/school. Things are more difficult, but everything that needs to be done is still getting done.",
                                            "Moderate: My anxiety definitely interferes with tasks. Most things are still getting done, but few things are being done as  well as in the past.",
                                            "Severe: My anxiety has really changed by ability to get things done. Some tasks are still being done, but many things are  not. My performance has definitely suffered.",
                                            "Extreme: My anxiety has become incapacitating. I am unable to complete tasks and have had to leave school, have quit or  been fired from my job, or have been unable to complete tasks at home and have faced consequences like bill collectors,  eviction, etc.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the past week, how much did your anxiety interfere with your social life and relationships?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interfere_social",
                                    "Parameters": {
                                        "Buttons": [
                                            "None: My anxiety doesn't affect my relationships.",
                                            "Mild: My anxiety slightly interferes with my relationships. Some of my friendships and other relationships have suffered, but, overall, my social life is still fulfilling.",
                                            "Moderate: I have experienced some interference with my social life, but I still have a few close relationships. I don't spend as much time with others as in the past, but I still socialize sometimes.",
                                            "Severe: My friendships and other relationships have suffered a lot because of anxiety. I do not enjoy social activities. I socialize very little.",
                                            "Extreme: My anxiety has completely disrupted my social activities. All of my relationships have suffered or ended. My family life is extremely strained.",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Sadness scale",
                    "Title": "Sadness scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nLittle interest or pleasure in doing things."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_interest",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Over the past 2 weeks, how often have you been bothered by any of the following problems:\n\nFeeling down, depressed, or hopeless."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_depressed",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Several days",
                                            "More than half the days",
                                            "Nearly every day",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Stress scale",
                    "Title": "Stress scale",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that you were unable to control the important things in your life?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_control",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt confident about your ability to handle your personal problems?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_personal",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt that things were going your way?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_way",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the last month, how often have you felt difficulties were piling up so high that you could not overcome them?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "biweekly_difficulties",
                                    "Parameters": {
                                        "Buttons": [
                                            "Never",
                                            "Almost Never",
                                            "Sometimes",
                                            "Fairly Often",
                                            "Very Often"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Interpretation Bias Measures",
                    "Title": "Interpretation Bias Measures",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In this brief exercise, you will read several short stories.\n\nPlease read each one carefully and try to imagine yourself in the situation.\n\nThe last word of each story is incomplete. Click on the missing letter to complete the word.\n\nAfter you correctly complete the word, you will be asked a question about the story. Answer the question based on the information in the story."
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are in the lobby of your friend's new apartment building.  You press the button to the elevator to go up. The building looks old. As you get on the elevator you think about its..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Elevator",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "safety"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you think about the elevator's safety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_elevator",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Your friend asks you to give a speech at her wedding reception. You prepare some remarks and when the time comes, get to your feet. As you speak, you notice some people in the audience start to..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Wedding Reception",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "laugh"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Does the audience laugh when you speak?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_wedding",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are currently working as a contractor for a company. Once this job is finished, you will be without employment until you can find your next job. You think about not having an income for a few weeks and about your future..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Job",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "finances"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Will you be without an income soon?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_job",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are woken up in the middle of the night by a loud noise. You are not sure what caused the noise and leave your bedroom to see what happened. You walk..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Loud Noise",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "downstairs"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Have you been woken up in the middle of the night?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_noise",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "In the street you bump into an old friend you haven't seen for a long time. She is too busy to stop, so you arrange to meet later in a bar. You arrive a little late but the bar is empty and a few minutes later she is still not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresMeeting a Friend",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "there"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did your friend stop?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_friend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are eating lunch with a friend. As you start eating your salad, you describe your plans for the weekend. You accidentally drop a piece of lettuce, and your friend looks at..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Lunch",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "you"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have salad for lunch?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_lunch",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are playing basketball with some friends. While running toward the ball, you trip and scrape your knee. The scrape hurts a bit, but does not..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Scrape",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "bleed"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you playing soccer with your friend?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_scrape",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at the mall with your friend. While you shop, she tells you how several of her friends have recently come down with a strange illness. You think about your recent health, and wonder if you will get..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Shopping Trip",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "sick"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Are you shopping alone?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_shopping",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "You are at a routine doctor's appointment. At the appointment, the doctor decides to run a few blood tests to check your health. The doctor says he will call you in a few weeks, and you will find out your test results at that..."
                                    }
                                },
                                {
                                    "Type": "WordPuzzle",
                                    "Name": "Interpretation Bias MeasuresThe Blood Test",
                                    "CorrectFeedback": "Correct!",
                                    "IncorrectFeedback": "Whoops! That doesn't look right. Please wait a moment and try again.",
                                    "CorrectScore": 0.5,
                                    "IncorrectDelay": 5000,
                                    "CauseNavigation": true,
                                    "Parameters": {
                                        "Words": [
                                            "time"
                                        ]
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you take blood tests?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "IBM_blood",
                                    "Parameters": {
                                        "Buttons": [
                                            "Yes",
                                            "No"
                                        ],
                                        "Selectable": true,
                                        "ColumnCount": 2
                                    }
                                }
                            ]
                        }
                    ]
                },
                {
                    "Name": "Track Your Progress",
                    "Title": "Track Your Progress",
                    "Type": "Survey",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How helpful did you find Hoos Think Calmly for reducing your anxiety?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "reduce_anxiety",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How likely would you be to recommend Hoos Think Calmly to others with similar anxiety difficulties?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "recommend",
                                    "Parameters": {
                                        "Buttons": [
                                            "Not at all",
                                            "Slightly",
                                            "Somewhat",
                                            "Mostly",
                                            "Very",
                                            "^Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Do you have moderate-to-severe anxiety or depression symptoms?"
                                    }
                                }
                            ]
                        },
                        {
                            "Conditions": [
                                {
                                    "VariableName": "AnxietyDepressionSymptoms",
                                    "Value": "Yes"
                                }
                            ],
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How open or interested are you in pursuing other forms of treatment from a mental health professional (e.g., therapy, medication) compared to before you started the program?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "interest_in_therapy",
                                    "Parameters": {
                                        "Buttons": [
                                            "Much more likely",
                                            "A little more likely",
                                            "Equally likely",
                                            "A little less likely",
                                            "Much less likely",
                                            "Not applicable (e.g., I'm currently undergoing another form of treatment)",
                                            "Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Conditions": [
                                {
                                    "VariableName": "AnxietyDepressionSymptoms",
                                    "Value": "Unsure"
                                }
                            ],
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "How open or interested are you in pursuing other forms of treatment from a mental health professional (e.g., therapy, medication) compared to before you started the program?"
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "interest_in_therapy",
                                    "Parameters": {
                                        "Buttons": [
                                            "Much more likely",
                                            "A little more likely",
                                            "Equally likely",
                                            "A little less likely",
                                            "Much less likely",
                                            "Not applicable (e.g., I'm currently undergoing another form of treatment)",
                                            "Prefer not to answer"
                                        ],
                                        "Selectable": true
                                    }
                                }
                            ]
                        },
                        {
                            "Inputs": [
                                {
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Did you contact any of the following resources or referrals at any point since you started using Hoos Think Calmly? Please select all that apply."
                                    }
                                },
                                {
                                    "Type": "Buttons",
                                    "Name": "resources_contacted",
                                    "Parameters": {
                                        "Buttons": [
                                            "Clubs and Organizations (e.g., cultural groups, volunteering)",
                                            "Counseling and Psychological Services (CAPS)",
                                            "Faculty and Employee Assistance Program (FEAP)",
                                            "HELP Line",
                                            "HoosWell",
                                            "Multicultural Student Centers (e.g., Interfaith, Latinx, LGBTQ)",
                                            "Office for Equal Opportunity and Civil Rights (EOCR)",
                                            "Office of African-American Affairs (OAAA)",
                                            "Office of Graduate and Postdoctoral Affairs",
                                            "Office of the Dean of Students (ODOS)",
                                            " PhD Plus",
                                            "Student Disability Access Center (SDAC)",
                                            "Student Financial Services",
                                            "Student Health and Wellness",
                                            "TimelyCare",
                                            "UVA Career Center",
                                            "UVA Human Resources (HR)",
                                            "UVA Women's Center",
                                            "UVA Writing Center",
                                            "WahooWell",
                                            "!Other",
                                            "I did not contact any of these resources/referrals since starting this program"
                                        ],
                                        "Selectable": true,
                                        "AllowMultipleSelections": true
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}