{
    "Name": "WhatIsAnxiety?",
    "Title": "What is Anxiety?",
    "Sections": [
        {
            "Name": "WhatIsAnxiety?",
            "PageGroups": [
                {
                    "Name": "WhatIsAnxiety?",
                    "Title": "What is Anxiety?",
                    "Type": "Survey",
                    "SubmitButtonText": "OK",
                    "Pages": [
                        {
                            "Inputs": [
 				{
                                    "Type": "Text",
                                    "Parameters": {
                                        "Text": "Please press play on the training video below to learn more!"
                                    }
                                },
                                {
                                    "Type": "Media",
                                    "Frame": false,
                                    "Parameters": {
                                        "ImageUrl": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/blob/main/HTC/protocols/MTM/media/videos/video4.mp4",
                                        "ImageType": "video/mp4"
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Frame": false,
                                    "Parameters": {
                                        "IsHtml": true,
                                        "Text": "<p>Anxiety is one of the most basic human emotions, and it is a normal and common experience. At one time or another, all of us are likely to feel stressed out and worried about work, health, or family. We might be scared in potentially dangerous situations, like driving during bad weather or before surgery. There might also be feelings of anxiety regarding what others think about us, like whether people will think we’re acting abnormally or whether others will be judgmental. Anxious feelings usually come with a variety of changes in one’s thoughts, bodily reactions, and behavior.</p><br><p>When Is Anxiety Helpful?</p><p>Anxiety can be a useful emotion! It has helped humans survive dangerous situations for thousands of years. For example, if you notice that your legs are feeling weak, you might begin to feel anxiety. That feeling of anxiety may be your body’s signal to yourself that you should sit down and rest. By listening to what your body is telling you, you could avoid a potentially dangerous fall. Anxiety helps people manage threats to their own health and well-being, and the well-being of others around them. A reasonable level of anxiety increases attention, concentration, and performance.</p><br><p>Of course, we also experience anxiety that isn’t directly related to our physical health.</p><br><p>So When Is Anxiety a Problem?</p><p>Although anxiety can be helpful in dangerous situations, it can also be harmful when there is no real threat. Too much anxiety can get in the way of people’s day-to-day life and might do more harm than good. It might become difficult to control what triggers anxiety and how long it lasts, even if a person knows there is no real danger. These are signs of harmful anxiety. People diagnosed with movement disorders like Huntington’s or Parkinson’s disease are more likely than others to experience harmful anxiety. They might feel especially worried when they notice a new or worsening symptom of their disease, resulting in anxious and negative thinking patterns.</p><br><p>This intervention aims to encourage flexible thinking patterns, minimizing the chance that you will exaggerate the risk of danger in your life. By shifting your thinking to be more flexible, anxiety can become more helpful than harmful and allow you to approach situations with a clearer head.</p>"
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}