{
    "Number": 2,
    "Name": "Session2_long",
    "Title": "Week 2: Part 2",
    "TimeToComplete": "00:05:00",
    "BeforeDomain": [
        {
            "Name": "Welcome Back!",
            "Title": "Welcome Back!",
            "Description": [
                "Welcome back to MindTrails! Let's get started with practicing flexible thinking. Today, you will: answer a few questions about your anxiety, complete 3 scenarios that challenge you to come up with thoughts, feelings, and behaviors, and wrap-up with a Quick Thinking exercise. Let's get started!"
            ],
            "Type": "Single",
            "Number": 0
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how anxious have you felt? 0 = Most calm I could imagine being. 10 = Most anxious, panicked, or scared I could imagine being."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -1
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much were you able to change the way you thought about things when you wanted to feel better. (An example might be: If you were feeling worried about an upcoming test, were you able to think about how much you studied, so that you felt less worried?) 0 = Not at all -- I wasn't able to think in different ways to feel better. 10 = Completely-- I was totally able to think in different ways to feel better. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "I didn't want/need to change how I was feeling",
                        "I'm not sure, or I wasn't paying attention to my feeling.",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -2
        },
        {
            "Name": "Three Brief Questions",
            "Title": "Three Brief Questions",
            "Description": [
                "Thinking about the last 24 hours, how much did you try to stay away from or be less involved in situations that would make you anxious or scared? (An example might be: If your teacher asked a question to the class and you knew the answer, do you not answer so you won't draw attention to yourself?) 0 = I tried to stay away from doing anything and everything that would make me anxious or scared. 10 = If there was something that would make me anxious or scared. "
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "I pushed myself to do it anyway or I didn't have anything that would make me anxious or scared in the last 24 hours.",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -3
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "In this exercise, please think of an UPCOMING situation that you expect will make you feel anxious, worried, or scared. Pick a situation that you worry might go badly, or that you expect will bring on feelings of anxiety (like racing heart, sweating). Any situation that will make you feel quite anxious or scared will work, as long as it is a situation that is likely to actually happen."
            ],
            "Type": "Single",
            "Number": -4
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please describe the situation in a few words:"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -5
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How anxious did you feel (at the highest level of anxiety) as you completed the imagery task?  0 = Absolutely no anxiety. 10 = Totally anxious."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Slider",
                "Parameters": {
                    "Minimum": "0",
                    "Maximum": "10",
                    "OtherChoices": [
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -6
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How vividly did you imagine the situation?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Not at all vivid",
                        "Somewhat vivid",
                        "Moderately vivid",
                        "Very vivid",
                        "Totally vivid",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -7
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "How likely is it that the situation or task will turn out well versus turn out badly?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Very likely to turn out well",
                        "Somewhat likely to turn out well",
                        "Neutral",
                        "Somewhat likely to turn out badly",
                        "Very likely to turn out badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -8
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "If this situation did turn out badly, how well or badly would you be able to handle it?"
            ],
            "Type": "Single",
            "Input": {
                "Type": "Picker",
                "Parameters": {
                    "Items": [
                        "Very well",
                        "Somewhat well",
                        "Neutral",
                        "Somewhat badly",
                        "Very badly",
                        "Prefer not to answer"
                    ]
                }
            },
            "Number": -9
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "On the next screen, you will be asked to write about a possible upcoming event in your life, or something that you are worried might happen. Before pressing NEXT, please think about a situation that might happen over the next week when you will feel anxious, scared, or worried. This can be a situation that makes you anxious a lot, or something that doesn't happen a lot. As you think of an event, try to really see yourself in the situation. Where are you? What day of the week is it? What time is it? Who is around you? What are you doing? How do you feel? After you come up with your situation, please press NEXT. Examples could include taking a test, talking to strangers, using social media, dealing with family or friends, or whatever makes you feel anxious."
            ],
            "Type": "Single",
            "Number": -10
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Please take a moment to write one or two sentences to describe the situation. Press next when you are ready to continue."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Number": -11
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "For the next 30 seconds, please picture yourself in this situation. When you are finished, the screen will change automatically."
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": "30"
                }
            },
            "Number": -12
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Now, take the next 90 seconds to think of as many different thoughts that you could have in the situation as you can. These thoughts can be negative or positive. Be as creative as possible with all of the different thoughts you could have while you're in the situation that makes you anxious, especially thoughts that would help you feel less anxious."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry",
                "Parameters": {
                    "Duration": "90"
                }
            },
            "Number": -13
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job! You predicted the future! Now, if your situation happens over the next week, you can have a lot of different thoughts come into your mind. Try to remember some of your thoughts that make you feel less anxious!"
            ],
            "Type": "Single",
            "Number": -14
        },
        {
            "Name": "Using Your Imagination",
            "Title": "Using Your Imagination",
            "Description": [
                "Great job practicing flexible thinking today. Remember, try to use your new flexible thinking skills before your next training session!"
            ],
            "Type": "Single",
            "Number": -15
        }
    ],
    "Domains": [
        {
            "Name": "Academics",
            "Title": "Academics",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Not doing well in math",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "During tonight's parent-teacher conference, your guardian is going to talk to your math teacher. You're not doing well in math, and you haven't told your guardian this yet. "
                    ],
                    "Words": [
                        "I am a good student, and my teacher will tell my guardian that. ",
                        "My teacher will say good things about me trying hard to learn. ",
                        "I'm going to be in big trouble. ",
                        "My guardian may ground me for doing badly in math, but I can handle it. ",
                        "My teacher will tell my guardian how I'm doing in the class, and I'll be OK with that. ",
                        "I'm glad my guardian cares enough to go talk to my teacher. ",
                        "I feel calm knowing that my guardian will love me no matter what my grade is. ",
                        "I'm worried about what my teacher will say to my guardian. ",
                        "I feel anxious thinking about the conversation, but I can focus on my homework until my guardian gets home. ",
                        "I'm uneasy right now, but this feeling won't last forever. ",
                        "I won't hide in my room when my guardian gets home. ",
                        "I'll ask my teacher how to bring up my grade. ",
                        "I'll skip math tomorrow. ",
                        "I want to avoid talking to my guardian, but know it's better to get it out of the way when they get home. ",
                        "I don't want to ask my teacher for help, but I know that if I do, that'll be best in the long run. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "Friends cheating",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're working on your math homework with a few friends and get stuck on a problem. Your friend suggests that you find the answer online, but that's considered cheating on the assignment. "
                    ],
                    "Words": [
                        "I want to do this homework without cheating. ",
                        "If I cheat, I actually won't learn the material for the test. ",
                        "My friends are going to laugh at me for saying I don't want to cheat. ",
                        "I hate homework, but at least it will be over soon. ",
                        "My friends will make fun of me for saying I don't want to cheat, but I know I'll feel worse if I do look up the answers online. ",
                        "I'll be relieved when this homework is done. ",
                        "I'm happier doing homework with my friends than when I'm alone.",
                        "I'm kind of frustrated that my friend say we should just cheat. ",
                        "I'm anxious that my friends will make fun of me, but if they do, I can handle it. ",
                        "I'm worried about my grade on the homework, but I know I'm trying my best. ",
                        "I decide that I won't cheat on this homework. ",
                        "I encourage my friends to try a little longer to work on this problem. ",
                        "I cheat to feel cool in front of my friends. ",
                        "I kind of want to cheat so that my friends don't judge me, but I decide not to. ",
                        "I feel myself wanting to cheat, but know that I really value being honest and not cheating. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Upset parents",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You notice your parents are upset with each other. They give you a short answer when you try to talk with them. "
                    ],
                    "Words": [
                        "I think about how it has nothing to do with me. ",
                        "I think about doing something nice for them. ",
                        "I ask myself if I did something wrong.",
                        "I think I am the reason that they are fighting, but remind myself that I'm probably not the real reason. ",
                        "I wonder if they're arguing over my grades, but then remember that it isn't my fault if they're not getting along.",
                        "I'm glad I am able to remove myself from the situation. ",
                        "I feel confident that this will blow over fairly quickly. ",
                        "I'm angry that they're always arguing.",
                        "I'm sad that they're arguing a lot, but know that I'm not the reason for it.",
                        "I feel anxious thinking about my parents not getting along, but remember that I can't do anything about it.",
                        "I walk away. ",
                        "I go do my homework. ",
                        "I yell at them to answer my question.",
                        "I give them some space and let my sad feelings pass. ",
                        "I want to storm off, but walk away calmly. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        },
        {
            "Name": "Social situations",
            "Title": "Social situations",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Shattered glass",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are at a quiet restaurant with a lot of your family members for dinner. While taking a drink of your water, you accidently drop the glass on the floor and it shatters."
                    ],
                    "Words": [
                        "I'm sure this has happened to other people.",
                        "I think about how I will help clean this up. ",
                        "I think I must be the most clumsy person on the planet. ",
                        "My parents might be embarrassed by me, but I know that it really isn't a big deal. ",
                        "I think the waitress will be annoyed, but think about how this moment will pass. ",
                        "I'm confident that the waitress will accept my apology.",
                        "I'm happy to be eating with my family. ",
                        "I'm embarrassed that I drew attention to myself. ",
                        "I'm annoyed at myself, but know that people will forget about the broken glass. ",
                        "I feel guilty about having broken a glass, but know that I didn't do it on purpose. ",
                        "I ask if I can help clean up.",
                        "I apologize to the wait staff and thank them for their help. ",
                        "I run to the bathroom so I don't have to talk to the waiter. ",
                        "I want to cry, but take a deep breath and remind myself that this happens. ",
                        "I want to leave the restaurant, but stay and have a good time. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "Halloween party",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are invited to a Halloween party and you will only know a couple of people there. You decide to wear a really elaborate costume. When you arrive, everyone looks at you. "
                    ],
                    "Words": [
                        "This is the best costume I've ever worn. ",
                        "I'm enjoying wearing this. ",
                        "The other kids are judging me for wearing this costume. ",
                        "I really stand out, but I think that's OK tonight. ",
                        "I think that I made a huge mistake by wearing this, but realize that it's OK to wear what I want. ",
                        "I'm excited to show off this costume. ",
                        "I'm proud of myself for wearing something that I love. ",
                        "I feel really awkward while everyone stares at me. ",
                        "I'm really anxious, but this feeling will pass. ",
                        "I'm worried that others are making fun of me, but if they are, that's their fault for judging me. ",
                        "I walk up to some friends and start a conversation. ",
                        "I'll post a picture of myself in this costume because I look great. ",
                        "I'll leave the party immediately. ",
                        "I want to change into something else, but decide to wear what I came in. ",
                        "I want to throw this costume away and never think of tonight again, but then remember that my friend complimented me earlier on it. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Turned off appliances",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your family are heading out of town for a few days and your parent asks you to double-check that all the appliances in your house are turned off before you leave. You had to rush to pack so didn't get to check everything. "
                    ],
                    "Words": [
                        "I think everything is turned off. ",
                        "I think about how I noticed during the first check everything was turned off. ",
                        "I think I missed something that may have been left on.",
                        "I think I may be responsible for a disaster, but realize I am overthinking. ",
                        "Even though I didn't get to fully check a second time before we all left, I'm pretty sure everything is off. ",
                        "I feel confident everything was shut off. ",
                        "I feel excited about the trip. ",
                        "I'm worried that an appliance was left on. ",
                        "I feel scared that I missed something, and then gently focus on what's going on in the car. ",
                        "I feel guilty about not fully checking everything, but remind myself that everything will probably be ok and the guilty feelings will pass. ",
                        "I decide to tell my parents I did not get to do a thorough second check. ",
                        "I focus on what's going on in the car. ",
                        "I think about all of the horrible things that could happen in the house.",
                        "I want to ask to go back to the house to check everything, but know that will make my anxiety worse in the future.",
                        "I want to cry thinking about how anxious I feel, but know that my anxiety will eventually go away."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        },
        {
            "Name": "Physical health",
            "Title": "Physical health",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Presentation in class",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You have to give a presentation in your international language class today. When you stand up in front of the class, you feel your cheeks get hot and your hands start to tremble."
                    ],
                    "Words": [
                        "These feelings are normal and they'll go away soon. ",
                        "Even if I'm a little shaky, I've prepared for this presentation. ",
                        "I think everyone will notice my red cheeks. ",
                        "It's possible that I'll completely forget what I was going to say, but I decide to get started and do my best. ",
                        "I don't like how my cheeks feel, but I can tolerate it and will try my best. ",
                        "I'm excited to do my presentation. ",
                        "I'm curious how I'll do on the presentation. ",
                        "I'm terrified that I'm going to stop breathing part-way through the presentation.",
                        "I'm embarrassed that my cheeks feel hot, but I doubt anyone will actually notice. ",
                        "I'm worried that I'm going to have a panic attack, but remind myself that it's normal to feel a little anxious while presenting. ",
                        "I begin my presentation with a good opening line. ",
                        "I hold a confident posture. ",
                        "I take a step outside of the room, and decide not to come back. ",
                        "I want to excuse myself, but decide to take a sip of water and carry on. ",
                        "I feel the urge to cover my face, but realize that no one probably cares if my cheeks are red. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "New grocery store",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You're at a new grocery store with your parent and you're looking for bread. Suddenly you notice that your heart is beating quickly and pounding. "
                    ],
                    "Words": [
                        "This store is really different from the one we usually go to. ",
                        "My heart must be pounding because I'm excited about this new store. ",
                        "I'm going to have a heart attack!",
                        "Even if this feeling in my chest is really uncomfortable, I know it will going away soon. ",
                        "I wonder if there's something wrong with my heart, but then tell myself that I'm probably fine. ",
                        "I'm excited to be in a new store. ",
                        "I'm happy trying finding our favorite foods in a new place.",
                        "I'm scared that my heart beating like this means something bad. ",
                        "I'm worried about my heart, but then remind myself that it's going to be OK. ",
                        "I'm nervous about my health, but realize that my heart is probably beating because I'm excited to be somewhere new. ",
                        "I ask an employee where the bread is. ",
                        "I notice the feeling in my chest and keep looking for the bread. ",
                        "I stop walking around and start to cry. ",
                        "I notice my beating heart and remind myself that I'm going to be ok. ",
                        "I tell myself that if this happens again, I'll ask my parent about it. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Not doing well in math",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "During tonight's parent-teacher conference, your guardian is going to talk to your math teacher. You're not doing well in math, and you haven't told your guardian this yet. "
                    ],
                    "Words": [
                        "I am a good student, and my teacher will tell my guardian that. ",
                        "My teacher will say good things about me trying hard to learn. ",
                        "I'm going to be in big trouble. ",
                        "My guardian may ground me for doing badly in math, but I can handle it. ",
                        "My teacher will tell my guardian how I'm doing in the class, and I'll be OK with that. ",
                        "I'm glad my guardian cares enough to go talk to my teacher. ",
                        "I feel calm knowing that my guardian will love me no matter what my grade is. ",
                        "I'm worried about what my teacher will say to my guardian. ",
                        "I feel anxious thinking about the conversation, but I can focus on my homework until my guardian gets home. ",
                        "I'm uneasy right now, but this feeling won't last forever. ",
                        "I won't hide in my room when my guardian gets home. ",
                        "I'll ask my teacher how to bring up my grade. ",
                        "I'll skip math tomorrow. ",
                        "I want to avoid talking to my guardian, but know it's better to get it out of the way when they get home. ",
                        "I don't want to ask my teacher for help, but I know that if I do, that'll be best in the long run. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        },
        {
            "Name": "Social media",
            "Title": "Social media",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Not a lot of likes",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You post something different from what you normally post. After a couple of hours, you only have about half the number of likes on your post compared to what you normally have. "
                    ],
                    "Words": [
                        "Everyone must be really busy. ",
                        "I am impressed with my post.",
                        "I think everyone is tired of my posts. ",
                        "I think people think it's a dumb post, but decide not to give that a second thought. ",
                        "I think everyone thought that post was boring, but I can sit with that. ",
                        "I'm amused with my post. ",
                        "I feel happy to be trying new things. ",
                        "I'll never post anything again. ",
                        "I'm embarrassed that no one liked what I posted, but then remember that the number of likes I get doesn't really matter. ",
                        "I feel like no one likes my creative post, but I'm able to tolerate it. ",
                        "I post another unique post the next day. ",
                        "I don't let the number of likes get me down and go about my day. ",
                        "I dwell on the post and sulk. ",
                        "I sit and check the number of likes, but decide to go out and enjoy the day. ",
                        "I want to delete my post, but remind myself that it doesn't really matter how many likes it gets. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "Tagged in a photo",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your friends took some pictures together. You look through your feed and see that they tagged you in a post. You don't like how you look in the picture."
                    ],
                    "Words": [
                        "My friends enjoy hanging out with me. ",
                        "I'm happy with the memories we made.",
                        "People are going to make fun of my face. ",
                        "I really don't like how I look in this picture, but it doesn't really make a difference if there's one bad picture of me online.",
                        "People may see the picture of me, but I can't control what my friend posts. ",
                        "I'm happy thinking about that memory.",
                        "I'm confident in my friendships. ",
                        "I'm annoyed that this isn't a flattering picture of me.",
                        "I feel angry at my friend, but know that she didn't know how I feel about the picture. ",
                        "I'm mad that I look so bad in the picture, and then remember that no one looks good all of the time. ",
                        "I keep scrolling on my feed.",
                        "I comment on the picture. ",
                        "I call my friend and tell her how upset I am. ",
                        "I want to have the picture removed, but decide to let my friend keep it up. ",
                        "I want to get off of social media, but stay on and post new pictures. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Shattered glass",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are at a quiet restaurant with a lot of your family members for dinner. While taking a drink of your water, you accidently drop the glass on the floor and it shatters."
                    ],
                    "Words": [
                        "I'm sure this has happened to other people.",
                        "I think about how I will help clean this up. ",
                        "I think I must be the most clumsy person on the planet. ",
                        "My parents might be embarrassed by me, but I know that it really isn't a big deal. ",
                        "I think the waitress will be annoyed, but think about how this moment will pass. ",
                        "I'm confident that the waitress will accept my apology.",
                        "I'm happy to be eating with my family. ",
                        "I'm embarrassed that I drew attention to myself. ",
                        "I'm annoyed at myself, but know that people will forget about the broken glass. ",
                        "I feel guilty about having broken a glass, but know that I didn't do it on purpose. ",
                        "I ask if I can help clean up.",
                        "I apologize to the wait staff and thank them for their help. ",
                        "I run to the bathroom so I don't have to talk to the waiter. ",
                        "I want to cry, but take a deep breath and remind myself that this happens. ",
                        "I want to leave the restaurant, but stay and have a good time. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        },
        {
            "Name": "Home life",
            "Title": "Home life",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Upset parents",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You notice your parents are upset with each other. They give you a short answer when you try to talk with them. "
                    ],
                    "Words": [
                        "I think about how it has nothing to do with me. ",
                        "I think about doing something nice for them. ",
                        "I ask myself if I did something wrong.",
                        "I think I am the reason that they are fighting, but remind myself that I'm probably not the real reason. ",
                        "I wonder if they're arguing over my grades, but then remember that it isn't my fault if they're not getting along.",
                        "I'm glad I am able to remove myself from the situation. ",
                        "I feel confident that this will blow over fairly quickly. ",
                        "I'm angry that they're always arguing.",
                        "I'm sad that they're arguing a lot, but know that I'm not the reason for it.",
                        "I feel anxious thinking about my parents not getting along, but remember that I can't do anything about it.",
                        "I walk away. ",
                        "I go do my homework. ",
                        "I yell at them to answer my question.",
                        "I give them some space and let my sad feelings pass. ",
                        "I want to storm off, but walk away calmly. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "Loud guardian",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "Your guardian is dropping you off at your sports practice. As they drop you off, they are really loud and everyone on your team looks at you. "
                    ],
                    "Words": [
                        "I'm lucky to have a guardian who takes me to sports practice.",
                        "I'm looking forward to practice today. ",
                        "My friends on the team are going to judge me.",
                        "My immediate thought is that my teammates will hate me, but I remind myself that I don't judge my friends for what their parents do.",
                        "My friends don't want me on the team because of my guardian. But then I realize that thought isn't realistic. ",
                        "I'm excited about practice. ",
                        "I'm eager to get on the field with my friends. ",
                        "I'm so embarrassed by my guardian.",
                        "I'm instantly feeling ashamed of my loud guardian, but remind myself that I can't control what my guardian does. ",
                        "I'm nervous while thinking about what my friends might say, but remember that I have really great friends. ",
                        "I run over to my teammates and start warming up. ",
                        "I grab a ball and get ready for practice.",
                        "I run to the bathroom and hope my friends didn't see my guardian drop me off. ",
                        "I'm want to avoid everyone around me since I'm afraid of what they're thinking, but remind myself that I can push myself to be friendly. ",
                        "I feel the urge to skip practice because I'm embarrassed, but know that my teammates need me. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Presentation in class",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You have to give a presentation in your international language class today. When you stand up in front of the class, you feel your cheeks get hot and your hands start to tremble."
                    ],
                    "Words": [
                        "These feelings are normal and they'll go away soon. ",
                        "Even if I'm a little shaky, I've prepared for this presentation. ",
                        "I think everyone will notice my red cheeks. ",
                        "It's possible that I'll completely forget what I was going to say, but I decide to get started and do my best. ",
                        "I don't like how my cheeks feel, but I can tolerate it and will try my best. ",
                        "I'm excited to do my presentation. ",
                        "I'm curious how I'll do on the presentation. ",
                        "I'm terrified that I'm going to stop breathing part-way through the presentation.",
                        "I'm embarrassed that my cheeks feel hot, but I doubt anyone will actually notice. ",
                        "I'm worried that I'm going to have a panic attack, but remind myself that it's normal to feel a little anxious while presenting. ",
                        "I begin my presentation with a good opening line. ",
                        "I hold a confident posture. ",
                        "I take a step outside of the room, and decide not to come back. ",
                        "I want to excuse myself, but decide to take a sip of water and carry on. ",
                        "I feel the urge to cover my face, but realize that no one probably cares if my cheeks are red. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        },
        {
            "Name": "General",
            "Title": "General",
            "Scenarios": [
                {
                    "Number": 1,
                    "Name": "Scenario1",
                    "Title": "Scenario 1",
                    "Caption": "Turned off appliances",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic0.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You and your family are heading out of town for a few days and your parent asks you to double-check that all the appliances in your house are turned off before you leave. You had to rush to pack so didn't get to check everything. "
                    ],
                    "Words": [
                        "I think everything is turned off. ",
                        "I think about how I noticed during the first check everything was turned off. ",
                        "I think I missed something that may have been left on.",
                        "I think I may be responsible for a disaster, but realize I am overthinking. ",
                        "Even though I didn't get to fully check a second time before we all left, I'm pretty sure everything is off. ",
                        "I feel confident everything was shut off. ",
                        "I feel excited about the trip. ",
                        "I'm worried that an appliance was left on. ",
                        "I feel scared that I missed something, and then gently focus on what's going on in the car. ",
                        "I feel guilty about not fully checking everything, but remind myself that everything will probably be ok and the guilty feelings will pass. ",
                        "I decide to tell my parents I did not get to do a thorough second check. ",
                        "I focus on what's going on in the car. ",
                        "I think about all of the horrible things that could happen in the house.",
                        "I want to ask to go back to the house to check everything, but know that will make my anxiety worse in the future.",
                        "I want to cry thinking about how anxious I feel, but know that my anxiety will eventually go away."
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 2,
                    "Name": "Scenario2",
                    "Title": "Scenario 2",
                    "Caption": "Babysitting",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic1.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You are babysitting a younger kid in your neighborhood and you're watching TV while they sleep. It's dark outside and you suddenly hear noises against the window. "
                    ],
                    "Words": [
                        "I think it must be the wind.",
                        "I think about how there are lots of animals outside at this time.",
                        "I think about how someone could be trying to break in. ",
                        "Even though my brain automatically goes to the worst case scenario, I remind myself that I'm probably safe.",
                        "I notice that I'm assuming the worst is going to happen, and remember that everything will actually be OK. ",
                        "I'm excited to make money while I'm babysitting.",
                        "I'm tired and am looking forward to going to bed.",
                        "I feel scared that I don't know what made that noise.",
                        "I feel terrified, but realize my brain is being very imaginative.",
                        "I'm worried about what's outside, but remind myself that it was probably the wind.",
                        "I check that the doors have been locked. ",
                        "I make sure to turn extra lights on and a funny movie. ",
                        "I call the family to come home immediately. ",
                        "I want to leave the house, but decide to stay. ",
                        "I want to wake up the child and ask if they hear anything, but instead let my anxiety pass. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                },
                {
                    "Number": 3,
                    "Name": "Scenario3",
                    "Title": "Scenario 3",
                    "Caption": "Not a lot of likes",
                    "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/Session2_long/pic2.jpeg",
                    "ImageType": "image/jpeg",
                    "ImageEmbedded": "True",
                    "ImageFromURL": "True",
                    "Description": [
                        "You post something different from what you normally post. After a couple of hours, you only have about half the number of likes on your post compared to what you normally have. "
                    ],
                    "Words": [
                        "Everyone must be really busy. ",
                        "I am impressed with my post.",
                        "I think everyone is tired of my posts. ",
                        "I think people think it's a dumb post, but decide not to give that a second thought. ",
                        "I think everyone thought that post was boring, but I can sit with that. ",
                        "I'm amused with my post. ",
                        "I feel happy to be trying new things. ",
                        "I'll never post anything again. ",
                        "I'm embarrassed that no one liked what I posted, but then remember that the number of likes I get doesn't really matter. ",
                        "I feel like no one likes my creative post, but I'm able to tolerate it. ",
                        "I post another unique post the next day. ",
                        "I don't let the number of likes get me down and go about my day. ",
                        "I dwell on the post and sulk. ",
                        "I sit and check the number of likes, but decide to go out and enjoy the day. ",
                        "I want to delete my post, but remind myself that it doesn't really matter how many likes it gets. "
                    ],
                    "Type": "TimedText",
                    "Input": {
                        "Type": "TimedText",
                        "Parameters": {
                            "Duration": 45
                        }
                    }
                }
            ]
        }
    ],
    "AfterDomain": [
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "On the next screen, you'll see a situation that might make someone nervous, worried, scared, or anxious. Here's an example: You're out with friends and receive this message from your parent saying, \"You need to come home right now.\""
            ],
            "Type": "Single",
            "Number": 100
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "In the text box, please write as many different thoughts that might come to your mind in that moment. You'll have 60 seconds to do this. For this example, you might write: What did I do wrong? My parent has something really important to tell me. I'm really tired, so I'm glad to be going home."
            ],
            "Type": "Single",
            "Input": {
                "Type": "None",
                "Parameters": {
                    "Duration": "60"
                }
            },
            "Number": 101
        },
        {
            "Name": "Quick Thinking",
            "Title": "Quick Thinking",
            "Description": [
                "You ask a new student at your school for their name on social media, and they don't respond."
            ],
            "Type": "Single",
            "Input": {
                "Type": "Entry"
            },
            "Image": "https://github.com/TeachmanLab/MindtrailsMobile_Resources/raw/main/bbbs/protocols/protocol1/media/images/quickthinking/pic2.jpeg",
            "ImageType": "image/jpeg",
            "ImageEmbedded": "true",
            "ImageFromUrl": "true",
            "Number": 102
        },
        {
            "Name": "Wrapping Up",
            "Title": "Wrapping Up",
            "Description": [
                "Great job practicing flexible thinking today. Remember, try to use your new flexible thinking skills before your next training session!"
            ],
            "Type": "Single",
            "Number": 103
        }
    ]
}