{
    "Name": "Disclaimer",
    "Title": "Disclaimer",
    "Sections": [
        {
            "Name": "BeforeDomain_1",
            "Doses": [
                1
            ],
            "PageGroups": [
                {
                    "Name": "Disclaimer",
                    "Title": "Disclaimer",
                    "Pages": [
                        {
                            "Inputs": [
                                {
                                    "Type": "Label",
                                    "Parameters": {
                                        "Text": "By accessing or using this mobile application, you agree to the following terms and conditions:"
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Participation in Online Anxiety Intervention Study",
                                    "Parameters": {
                                        "Text": "These Terms and Conditions supplement the Consent Agreement that you will sign as a research study participant, during the term of your active participation in the study. If any provision in the Consent Agreement conflicts with these Terms and Conditions, the provision in the Consent Agreement applies to your participation in the study, not the conflicting provision in these Terms and Conditions. If you are a former participant in the research study and are accessing this mobile application to do the exercises on your own, please see \"Information for Former Study Participants\" below."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Diagnostic and Treatment Information",
                                    "Parameters": {
                                        "Text": "Please see the Consent Agreement if you are a current research study participant."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Gift Cards",
                                    "Parameters": {
                                        "Text": "The awarding of gift cards for completion of the research study assessments will be available while supplies last."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Links to Other Sites",
                                    "Parameters": {
                                        "Text": "Some MindTrails pages may link to those of other organizations. Appearance of a website link here does not imply an endorsement of their views, policies or products. Once you click on a link to another site, you are subject to its privacy policy. MindTrails has not participated in the development of the sites of other organizations and does not exert any control over the content of those sites. MindTrails is not responsible for the accuracy or content of information contained in those sites."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Links from Other Sites",
                                    "Parameters": {
                                        "Text": "MindTrails does not exert any control over the content of sites linking to the MindTrails website or Hoos Think Calmly mobile application. MindTrails is not responsible for the accuracy or content of information contained in those sites."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Pop-Up Advertisements",
                                    "Parameters": {
                                        "Text": "When visiting our site, your device may produce \"pop-up\" advertisements (advertisements that spontaneously appear on your computer screen). The most likely source of such an advertisement is another website you visited or third-party software on your computer. MindTrails does not endorse or recommend products or services featured in advertisements that \"pop up\" during your visit to our site."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Ownership and Use of This Mobile Application",
                                    "Parameters": {
                                        "Text": "The Hoos Think Calmly application and all intellectual property associated with it is owned by the University of Virginia, and may not be used, reproduced or distributed for any commercial purpose. It may be used for non-commercial purposes, such as educational or research purposes, only with prior written permission. To apply for permission, contact HoosThinkCalmly@gmail.com."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Age of Consent",
                                    "Parameters": {
                                        "Text": "In the United States, the minimum age for consent to participate in research studies in most states and territories is 18, with the exception of Nebraska (19) and Puerto Rico (21). To be eligible to participate in the Hoos Think Calmly study, individuals must have attained the legal age for consent to participate in research studies under the applicable law of their local jurisdiction."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Information for Former Study Participants",
                                    "Parameters": {
                                        "Text": "If you are a former research study participant and wish to access mental health resources, please click on the \"Mental Health Resources\" tab at the top of this webpage. If you need to contact the Hoos Think Calmly team, please email HoosThinkCalmly@gmail.com."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Diagnosis and Treatment",
                                    "Parameters": {
                                        "Text": "This application does not provide personalized diagnostic, medical or treatment advice. You should consult with a qualified mental health or health care provider for diagnosis and treatment information. We do not offer crisis management or real-time monitoring of email. If you are experiencing a medical or mental health emergency, you should not rely on any information on this app, and should seek appropriate emergency medical assistance, such as by calling 911."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Disclaimer",
                                    "Parameters": {
                                        "Text": "The creators and owner of Hoos Think Calmly are not responsible for, and disclaim all liability for damages of any kind arising out of participation in the tests, the training programs, and other general interest and educational use of this mobile application, or reference to or reliance on any information contained within this application. The user’s use of this application is at the user’s sole risk."
                                    }
                                },
                                {
                                    "Type": "Text",
                                    "Label": "Release",
                                    "Parameters": {
                                        "Text": "In consideration for being permitted to use this application, you agree that all use of this application shall be undertaken at your own risk, and that the University of Virginia, its officers, agents and employees shall not be liable for any claims, damages, injuries, actions, or causes of action whatsoever, to you or to your executors, heirs, or assigns, arising out of or connected with access to or use of this application."
                                    }
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}

